xdu-aero-association/FM33LC0XX_Example_0.04/COMP 比较器 休眠中断/Drivers/FM33LC0xx_LL_Driver/Inc/fm33lc0xx_ll_gptim.h
/**
  *******************************************************************************************************
  * @file    fm33lc0xx_ll_gptim.h
  * @author  FMSH Application Team
  * @brief   Head file of GPTIM LL Module
  *******************************************************************************************************
  * @attention
  *
  * Copyright (c) [2019] [Fudan Microelectronics]
  * THIS SOFTWARE is licensed under the Mulan PSL v1.
  * can use this software according to the terms and conditions of the Mulan PSL v1.
  * You may obtain a copy of Mulan PSL v1 at:
  * http://license.coscl.org.cn/MulanPSL
  * THIS SOFTWARE IS PROVIDED ON AN "AS IS" BASIS, WITHOUT WARRANTIES OF ANY KIND, EITHER EXPRESS OR
  * IMPLIED, INCLUDING BUT NOT LIMITED TO NON-INFRINGEMENT, MERCHANTABILITY OR FIT FOR A PARTICULAR
  * PURPOSE.
  * See the Mulan PSL v1 for more details.
  *
  *******************************************************************************************************
  */


/* Define to prevent recursive inclusion---------------------------------------------------------------*/
#ifndef __FM33LC0XX_LL_GPTIM_H
#define __FM33LC0XX_LL_GPTIM_H

#ifdef __cplusplus
extern "C" {
#endif
/* Includes -------------------------------------------------------------------------------------------*/
#include "fm33xx.h"
/** @addtogroup FM33LC0XX_LL_Driver_GPTIM
  * @{
  */
/* Exported types -------------------------------------------------------------------------------------*/
/** @defgroup GPTIM_LL_ES_INIT GPTIM Exported Init structures
  * @{
  */

/**
  * @brief LL GPTIM Init Sturcture definition
  */
/**
  * @brief  TIM Time Base configuration structure definition.
  */
typedef struct
{
    /*! 预分频系数 */  
    uint32_t Prescaler;        
    /*! 计数模式 */
    uint32_t CounterMode;      
    /*! 自动重装载值 */
    uint32_t Autoreload;
    /*! 预装载使能 */   
    uint32_t AutoreloadState;     
    /*!定时器分频系数与数字滤波器所使用的采样时钟分频比*/
    uint32_t ClockDivision;     
                                                         
} LL_GPTIM_InitTypeDef;
/**
  * @brief GTIM SlaveMode Init Sturcture definition
  */
typedef struct
{ 
    /*! TRx 源*/
    uint32_t ITRxSrc;
    /*! 外部时钟源模式 */
    uint32_t SlaveMode;           
    /*! 输入触发信号选择 */
    uint32_t TriggerSrc; 
    /*! Trigger 延迟*/
    uint32_t TriggerDelay; 
                                                         
} LL_GPTIM_SlaveInitTypeDef;
/**
  * @brief  TIM Input Capture configuration structure definition.
  */

typedef struct
{
    /*! 输入捕获使能 */    
    uint32_t CaptureState; 
    /*! 输入捕获极性 */    
    uint32_t ICPolarity;    
    /*! 通道映射激活的输入选择 */
    uint32_t ICActiveInput; 
    /*! 输入分频 */
    uint32_t ICPrescaler;   
    /*! 输入滤波 */
    uint32_t ICFilter;      
                       
} LL_GPTIM_IC_InitTypeDef;
/**
  * @brief  TIM ETR  configuration structure definition.
  */

typedef struct
{
    /*! 外部触发使能 */    
    uint32_t AsExternal; 
   /*! 外部时钟滤波 */   
    uint32_t ETRFilter;       
    /*! 外部时钟分频 */
    uint32_t ETRClockDivision;
    /*! 外部时钟触发极性 */
    uint32_t ETRPolarity;      
                       
} LL_GPTIM_ETR_InitTypeDef;

/**
  * @brief  TIM Output Compare configuration structure definition.
  */
typedef struct
{
    /*! 比较输出模式 */   
    uint32_t OCMode;  
    /*! 比较输出通道快速模式使能 */
    uint32_t OCFastMode;       
    /*! 输出比较预装载 */
    uint32_t OCPreload;        
    /*! 通道比较值 */
    uint32_t CompareValue; 
    /*! 比较输出极性 */
    uint32_t OCPolarity;   
    /*! ETR清0使能 */
    uint32_t OCETRFStatus; 
                        
} LL_GPTIM_OC_InitTypeDef;


/**
  * @}
  */
/* Exported constants ---------------------------------------------------------------------------------*/
/** @defgroup GPTIM_LL_Exported_Constants GPTIM Exported Constants
  * @{
  */
#define    LL_GPTIM_CHANNEL_1                                     (0x0U << 0U)
#define    LL_GPTIM_CHANNEL_2                                     (0x1U << 0U)
#define    LL_GPTIM_CHANNEL_3                                     (0x2U << 0U)
#define    LL_GPTIM_CHANNEL_4                                     (0x3U << 0U)

#define    LL_GPTIM_CLOCKDIVISION_DIV1                            (0x0U << GPTIM_CR1_CKD_Pos)
#define    LL_GPTIM_CLOCKDIVISION_DIV2                            (0x1U << GPTIM_CR1_CKD_Pos)
#define    LL_GPTIM_CLOCKDIVISION_DIV4                            (0x2U << GPTIM_CR1_CKD_Pos)

#define    LL_GPTIM_COUNTER_ALIGNED_EDGE                          (0x0U << GPTIM_CR1_CMS_Pos)
#define    LL_GPTIM_COUNTER_ALIGNED_CENTER_DOWN                   (0x1U << GPTIM_CR1_CMS_Pos)
#define    LL_GPTIM_COUNTER_ALIGNED_CENTER_UP                     (0x2U << GPTIM_CR1_CMS_Pos)
#define    LL_GPTIM_COUNTER_ALIGNED_CENTER_UP_DOWN                (0x3U << GPTIM_CR1_CMS_Pos)

#define    LL_GPTIM_COUNTER_DIRECT_UP                             (0x0U << GPTIM_CR1_DIR_Pos)
#define    LL_GPTIM_COUNTER_DIRECT_DOWN                           (0x1U << GPTIM_CR1_DIR_Pos)

#define    LL_GPTIM_ONEPULSEMODE_REPETITIVE                       (0x0U << GPTIM_CR1_OPM_Pos)
#define    LL_GPTIM_ONEPULSEMODE_SINGLE                           (0x1U << GPTIM_CR1_OPM_Pos)

#define    LL_GPTIM_UPDATESOURCE_REGULAR                          (0x0U << GPTIM_CR1_URS_Pos)
#define    LL_GPTIM_UPDATESOURCE_COUNTER                          (0x1U << GPTIM_CR1_URS_Pos)

#define    LL_GPTIM_TRGO_RESET                                    (0x0U << GPTIM_CR2_MMS_Pos)
#define    LL_GPTIM_TRGO_ENABLE                                   (0x1U << GPTIM_CR2_MMS_Pos)
#define    LL_GPTIM_TRGO_UPDATE                                   (0x2U << GPTIM_CR2_MMS_Pos)
#define    LL_GPTIM_TRGO_CC1IF                                    (0x3U << GPTIM_CR2_MMS_Pos)
#define    LL_GPTIM_TRGO_OC1REF                                   (0x4U << GPTIM_CR2_MMS_Pos)
#define    LL_GPTIM_TRGO_OC2REF                                   (0x5U << GPTIM_CR2_MMS_Pos)
#define    LL_GPTIM_TRGO_OC3REF                                   (0x6U << GPTIM_CR2_MMS_Pos)
#define    LL_GPTIM_TRGO_OC4REF                                   (0x7U << GPTIM_CR2_MMS_Pos)

