xdu-aero-association/FM33LC0XX_Example_0.04/COMP 比较器 休眠中断/Drivers/FM33LC0xx_LL_Driver/Inc/fm33lc0xx_ll_gptim.h
#define    LL_GPTIM_CCDMAREQUEST_CC                               (0x0U << GPTIM_CR2_CCDS_Pos)
#define    LL_GPTIM_CCDMAREQUEST_UPDATE                           (0x1U << GPTIM_CR2_CCDS_Pos)

#define    LL_GPTIM_ETR_POLARITY_NONINVERTED                      (0x0U << GPTIM_SMCR_ETP_Pos)
#define    LL_GPTIM_ETR_POLARITY_NINVERTED                        (0x1U << GPTIM_SMCR_ETP_Pos)

#define    LL_GPTIM_ETR_PRESCALER_DIV1                            (0x0U << GPTIM_SMCR_ETPS_Pos)
#define    LL_GPTIM_ETR_PRESCALER_DIV2                            (0x1U << GPTIM_SMCR_ETPS_Pos)
#define    LL_GPTIM_ETR_PRESCALER_DIV4                            (0x2U << GPTIM_SMCR_ETPS_Pos)
#define    LL_GPTIM_ETR_PRESCALER_DIV8                            (0x3U << GPTIM_SMCR_ETPS_Pos)

#define    LL_GPTIM_ETR_FILTER_FDIV1                              (0x0U << GPTIM_SMCR_ETF_Pos)
#define    LL_GPTIM_ETR_FILTER_FDIV1_N2                           (0x1U << GPTIM_SMCR_ETF_Pos)
#define    LL_GPTIM_ETR_FILTER_FDIV1_N4                           (0x2U << GPTIM_SMCR_ETF_Pos)
#define    LL_GPTIM_ETR_FILTER_FDIV1_N8                           (0x3U << GPTIM_SMCR_ETF_Pos)
#define    LL_GPTIM_ETR_FILTER_FDIV2_N6                           (0x4U << GPTIM_SMCR_ETF_Pos)
#define    LL_GPTIM_ETR_FILTER_FDIV2_N8                           (0x5U << GPTIM_SMCR_ETF_Pos)
#define    LL_GPTIM_ETR_FILTER_FDIV4_N6                           (0x6U << GPTIM_SMCR_ETF_Pos)
#define    LL_GPTIM_ETR_FILTER_FDIV4_N8                           (0x7U << GPTIM_SMCR_ETF_Pos)
#define    LL_GPTIM_ETR_FILTER_FDIV8_N6                           (0x8U << GPTIM_SMCR_ETF_Pos)
#define    LL_GPTIM_ETR_FILTER_FDIV8_N8                           (0x9U << GPTIM_SMCR_ETF_Pos)
#define    LL_GPTIM_ETR_FILTER_FDIV16_N5                          (0xaU << GPTIM_SMCR_ETF_Pos)
#define    LL_GPTIM_ETR_FILTER_FDIV16_N6                          (0xbU << GPTIM_SMCR_ETF_Pos)
#define    LL_GPTIM_ETR_FILTER_FDIV16_N8                          (0xcU << GPTIM_SMCR_ETF_Pos)
#define    LL_GPTIM_ETR_FILTER_FDIV32_N5                          (0xdU << GPTIM_SMCR_ETF_Pos)
#define    LL_GPTIM_ETR_FILTER_FDIV32_N6                          (0xeU << GPTIM_SMCR_ETF_Pos)
#define    LL_GPTIM_ETR_FILTER_FDIV32_N8                          (0xfU << GPTIM_SMCR_ETF_Pos)

#define    LL_GPTIM_TIM_TS_ITR0                                   (0x0U << GPTIM_SMCR_TS_Pos)
#define    LL_GPTIM_TIM_TS_ITR1                                   (0x1U << GPTIM_SMCR_TS_Pos)
#define    LL_GPTIM_TIM_TS_ITR2                                   (0x2U << GPTIM_SMCR_TS_Pos)
#define    LL_GPTIM_TIM_TS_ITR3                                   (0x3U << GPTIM_SMCR_TS_Pos)
#define    LL_GPTIM_TIM_TS_TI1F_ED                                (0x4U << GPTIM_SMCR_TS_Pos)
#define    LL_GPTIM_TIM_TS_TI1FP1                                 (0x5U << GPTIM_SMCR_TS_Pos)
#define    LL_GPTIM_TIM_TS_TI2FP1                                 (0x6U << GPTIM_SMCR_TS_Pos)
#define    LL_GPTIM_TIM_TS_ETRF                                   (0x7U << GPTIM_SMCR_TS_Pos)

#define    LL_GPTIM_SLAVE_MODE_PROHIBITED                         (0x0U << GPTIM_SMCR_SMS_Pos)
#define    LL_GPTIM_SLAVE_MODE_TI1FP1_TI2FP2_CNT                  (0x1U << GPTIM_SMCR_SMS_Pos)
#define    LL_GPTIM_SLAVE_MODE_TI2FP2_TI1FP1_CNT                  (0x2U << GPTIM_SMCR_SMS_Pos)
#define    LL_GPTIM_SLAVE_MODE_TI2FP2_CNT_TI1FP1_CNT              (0x3U << GPTIM_SMCR_SMS_Pos)
#define    LL_GPTIM_SLAVE_MODE_TRGI_RISE_RST                      (0x4U << GPTIM_SMCR_SMS_Pos)
#define    LL_GPTIM_SLAVE_MODE_TRGI_HIGH_RUN                      (0x5U << GPTIM_SMCR_SMS_Pos)
#define    LL_GPTIM_SLAVE_MODE_TRGI_RISE_RUN                      (0x6U << GPTIM_SMCR_SMS_Pos)
#define    LL_GPTIM_SLAVE_MODE_TRGI_CLK                           (0x7U << GPTIM_SMCR_SMS_Pos)


#define    LL_GPTIM_DMABURST_LENGTH_1TRANSFER                     (0x0U << GPTIM_DCR_DBL_Pos)
#define    LL_GPTIM_DMABURST_LENGTH_2TRANSFERS                    (0x1U << GPTIM_DCR_DBL_Pos)
#define    LL_GPTIM_DMABURST_LENGTH_3TRANSFERS                    (0x2U << GPTIM_DCR_DBL_Pos)
#define    LL_GPTIM_DMABURST_LENGTH_4TRANSFERS                    (0x3U << GPTIM_DCR_DBL_Pos)
#define    LL_GPTIM_DMABURST_LENGTH_5TRANSFERS                    (0x4U << GPTIM_DCR_DBL_Pos)
#define    LL_GPTIM_DMABURST_LENGTH_6TRANSFERS                    (0x5U << GPTIM_DCR_DBL_Pos)
#define    LL_GPTIM_DMABURST_LENGTH_7TRANSFERS                    (0x6U << GPTIM_DCR_DBL_Pos)
#define    LL_GPTIM_DMABURST_LENGTH_8TRANSFERS                    (0x7U << GPTIM_DCR_DBL_Pos)
#define    LL_GPTIM_DMABURST_LENGTH_9TRANSFERS                    (0x8U << GPTIM_DCR_DBL_Pos)
#define    LL_GPTIM_DMABURST_LENGTH_10TRANSFERS                   (0x9U << GPTIM_DCR_DBL_Pos)
#define    LL_GPTIM_DMABURST_LENGTH_11TRANSFERS                   (0xaU << GPTIM_DCR_DBL_Pos)
#define    LL_GPTIM_DMABURST_LENGTH_12TRANSFERS                   (0xbU << GPTIM_DCR_DBL_Pos)
#define    LL_GPTIM_DMABURST_LENGTH_13TRANSFERS                   (0xcU << GPTIM_DCR_DBL_Pos)
#define    LL_GPTIM_DMABURST_LENGTH_14TRANSFERS                   (0xdU << GPTIM_DCR_DBL_Pos)
#define    LL_GPTIM_DMABURST_LENGTH_15TRANSFERS                   (0xeU << GPTIM_DCR_DBL_Pos)
#define    LL_GPTIM_DMABURST_LENGTH_16TRANSFERS                   (0xfU << GPTIM_DCR_DBL_Pos)
#define    LL_GPTIM_DMABURST_LENGTH_17TRANSFERS                   (0x10U << GPTIM_DCR_DBL_Pos)
#define    LL_GPTIM_DMABURST_LENGTH_18TRANSFERS                   (0x11U << GPTIM_DCR_DBL_Pos)

#define    LL_GPTIM_DMABURST_BASEADDR_CR1                         (0x0U << GPTIM_DCR_DBA_Pos)
#define    LL_GPTIM_DMABURST_BASEADDR_CR2                         (0x1U << GPTIM_DCR_DBA_Pos)
#define    LL_GPTIM_DMABURST_BASEADDR_SMCR                        (0x2U << GPTIM_DCR_DBA_Pos)
#define    LL_GPTIM_DMABURST_BASEADDR_DIER                        (0x3U << GPTIM_DCR_DBA_Pos)
#define    LL_GPTIM_DMABURST_BASEADDR_SR                          (0x4U << GPTIM_DCR_DBA_Pos)
#define    LL_GPTIM_DMABURST_BASEADDR_EGR                         (0x5U << GPTIM_DCR_DBA_Pos)
#define    LL_GPTIM_DMABURST_BASEADDR_CCMR1                       (0x6U << GPTIM_DCR_DBA_Pos)
#define    LL_GPTIM_DMABURST_BASEADDR_CCMR2                       (0x7U << GPTIM_DCR_DBA_Pos)
#define    LL_GPTIM_DMABURST_BASEADDR_CCER                        (0x8U << GPTIM_DCR_DBA_Pos)
#define    LL_GPTIM_DMABURST_BASEADDR_CNT                         (0x9U << GPTIM_DCR_DBA_Pos)
#define    LL_GPTIM_DMABURST_BASEADDR_PSC                         (0xaU << GPTIM_DCR_DBA_Pos)
#define    LL_GPTIM_DMABURST_BASEADDR_ARR                         (0xbU << GPTIM_DCR_DBA_Pos)
#define    LL_GPTIM_DMABURST_BASEADDR_RCR                         (0xcU << GPTIM_DCR_DBA_Pos)
#define    LL_GPTIM_DMABURST_BASEADDR_CCR1                        (0xdU << GPTIM_DCR_DBA_Pos)
#define    LL_GPTIM_DMABURST_BASEADDR_CCR2                        (0xeU << GPTIM_DCR_DBA_Pos)
#define    LL_GPTIM_DMABURST_BASEADDR_CCR3                        (0xfU << GPTIM_DCR_DBA_Pos)
#define    LL_GPTIM_DMABURST_BASEADDR_CCR4                        (0x10U << GPTIM_DCR_DBA_Pos)
#define    LL_GPTIM_DMABURST_BASEADDR_BDTR                        (0x11U << GPTIM_DCR_DBA_Pos)

