xdu-aero-association/FM33LC0XX_Example_0.04/COMP 比较器 休眠中断/Drivers/FM33LC0xx_LL_Driver/Inc/fm33lc0xx_ll_gptim.h
#define    LL_GPTIM_ITR0SEL_ATIM_TRGO                             (0x0U << GPTIM_ITRSEL_ITR0SEL_Pos)
#define    LL_GPTIM_ITR0SEL_UART0_RX                              (0x1U << GPTIM_ITRSEL_ITR0SEL_Pos)
#define    LL_GPTIM_ITR0SEL_UART1_RX                              (0x2U << GPTIM_ITRSEL_ITR0SEL_Pos)
#define    LL_GPTIM_ITR0SEL_UART4_RX                              (0x3U << GPTIM_ITRSEL_ITR0SEL_Pos)

#define    LL_GPTIM_ITR1SEL_GPTIM1_TRGO                           (0x0U << GPTIM_ITRSEL_ITR1SEL_Pos)
#define    LL_GPTIM_ITR1SEL_XTHF                                  (0x1U << GPTIM_ITRSEL_ITR1SEL_Pos)
#define    LL_GPTIM_ITR1SEL_RCHF                                  (0x2U << GPTIM_ITRSEL_ITR1SEL_Pos)
#define    LL_GPTIM_ITR1SEL_LPUART0_RX                            (0x3U << GPTIM_ITRSEL_ITR1SEL_Pos)

#define    LL_GPTIM_ITR2SEL_BSTIM_TRGO                            (0x0U << GPTIM_ITRSEL_ITR2SEL_Pos)
#define    LL_GPTIM_ITR2SEL_LPUART1_TX                            (0x1U << GPTIM_ITRSEL_ITR2SEL_Pos)
#define    LL_GPTIM_ITR2SEL_RCLP                                  (0x2U << GPTIM_ITRSEL_ITR2SEL_Pos)
#define    LL_GPTIM_ITR2SEL_XTLF                                  (0x3U << GPTIM_ITRSEL_ITR2SEL_Pos)

#define    LL_GPTIM_ITR3SEL_COMP1_TRGO                            (0x0U << GPTIM_ITRSEL_ITR3SEL_Pos)
#define    LL_GPTIM_ITR3SEL_RC4M                                  (0x1U << GPTIM_ITRSEL_ITR3SEL_Pos)
#define    LL_GPTIM_ITR3SEL_COMP2_TRGO                            (0x2U << GPTIM_ITRSEL_ITR3SEL_Pos)
#define    LL_GPTIM_ITR3SEL_LPT32_TRGO                            (0x3U << GPTIM_ITRSEL_ITR3SEL_Pos)

#define    LL_GPTIM_ITR1SEL_GPTIM0_TRGO                           (0x0U << GPTIM_ITRSEL_ITR1SEL_Pos)
#define    LL_GPTIM_ITR1SEL_ADC_EOC                               (0x3U << GPTIM_ITRSEL_ITR1SEL_Pos)

#define    LL_GPTIM_ITR2SEL_LSCLK                                 (0x1U << GPTIM_ITRSEL_ITR2SEL_Pos)


#define    LL_GPTIM_OC_MODE_FROZEN                                (0x0U << GPTIM_CCMR_OCM_Pos)
#define    LL_GPTIM_OC_MODE_ACTIVE                                (0x1U << GPTIM_CCMR_OCM_Pos)
#define    LL_GPTIM_OC_MODE_INACTIVE                              (0x2U << GPTIM_CCMR_OCM_Pos)
#define    LL_GPTIM_OC_MODE_TOGGLE                                (0x3U << GPTIM_CCMR_OCM_Pos)
#define    LL_GPTIM_OC_MODE_FORCED_INACTIVE                       (0x4U << GPTIM_CCMR_OCM_Pos)
#define    LL_GPTIM_OC_MODE_FORCED_ACTIVE                         (0x5U << GPTIM_CCMR_OCM_Pos)
#define    LL_GPTIM_OC_MODE_PWM1                                  (0x6U << GPTIM_CCMR_OCM_Pos)
#define    LL_GPTIM_OC_MODE_PWM2                                  (0x7U << GPTIM_CCMR_OCM_Pos)

#define    LL_GPTIM_IC_FILTER_FDIV1                               (0x0U << GPTIM_CCMR_ICF_Pos)
#define    LL_GPTIM_IC_FILTER_FDIV1_N2                            (0x1U << GPTIM_CCMR_ICF_Pos)
#define    LL_GPTIM_IC_FILTER_FDIV1_N4                            (0x2U << GPTIM_CCMR_ICF_Pos)
#define    LL_GPTIM_IC_FILTER_FDIV1_N8                            (0x3U << GPTIM_CCMR_ICF_Pos)
#define    LL_GPTIM_IC_FILTER_FDIV2_N6                            (0x4U << GPTIM_CCMR_ICF_Pos)
#define    LL_GPTIM_IC_FILTER_FDIV2_N8                            (0x5U << GPTIM_CCMR_ICF_Pos)
#define    LL_GPTIM_IC_FILTER_FDIV4_N6                            (0x6U << GPTIM_CCMR_ICF_Pos)
#define    LL_GPTIM_IC_FILTER_FDIV4_N8                            (0x7U << GPTIM_CCMR_ICF_Pos)
#define    LL_GPTIM_IC_FILTER_FDIV8_N6                            (0x8U << GPTIM_CCMR_ICF_Pos)
#define    LL_GPTIM_IC_FILTER_FDIV8_N8                            (0x9U << GPTIM_CCMR_ICF_Pos)
#define    LL_GPTIM_IC_FILTER_FDIV16_N5                           (0xaU << GPTIM_CCMR_ICF_Pos)
#define    LL_GPTIM_IC_FILTER_FDIV16_N6                           (0xbU << GPTIM_CCMR_ICF_Pos)
#define    LL_GPTIM_IC_FILTER_FDIV16_N8                           (0xcU << GPTIM_CCMR_ICF_Pos)
#define    LL_GPTIM_IC_FILTER_FDIV32_N5                           (0xdU << GPTIM_CCMR_ICF_Pos)
#define    LL_GPTIM_IC_FILTER_FDIV32_N6                           (0xeU << GPTIM_CCMR_ICF_Pos)
#define    LL_GPTIM_IC_FILTER_FDIV32_N8                           (0xfU << GPTIM_CCMR_ICF_Pos)

#define    LL_GPTIM_IC_PRESCALER_DIV_1                            (0x0U << GPTIM_CCMR_ICPSC_Pos)
#define    LL_GPTIM_IC_PRESCALER_DIV_2                            (0x1U << GPTIM_CCMR_ICPSC_Pos)
#define    LL_GPTIM_IC_PRESCALER_DIV_4                            (0x2U << GPTIM_CCMR_ICPSC_Pos)
#define    LL_GPTIM_IC_PRESCALER_DIV_8                            (0x3U << GPTIM_CCMR_ICPSC_Pos)

#define    LL_GPTIM_CC_MODE_OUTPUT                                (0x0U << GPTIM_CCMR_CCS_Pos)
#define    LL_GPTIM_CC1_MODE_INPUT_TI1                             (0x1U << GPTIM_CCMR_CCS_Pos)
#define    LL_GPTIM_CC1_MODE_INPUT_TI2                             (0x2U << GPTIM_CCMR_CCS_Pos)
#define    LL_GPTIM_CC2_MODE_INPUT_TI2                             (0x1U << GPTIM_CCMR_CCS_Pos)
#define    LL_GPTIM_CC2_MODE_INPUT_TI1                             (0x2U << GPTIM_CCMR_CCS_Pos)
#define    LL_GPTIM_CC3_MODE_INPUT_TI3                             (0x1U << GPTIM_CCMR_CCS_Pos)
#define    LL_GPTIM_CC3_MODE_INPUT_TI4                             (0x2U << GPTIM_CCMR_CCS_Pos)
#define    LL_GPTIM_CC4_MODE_INPUT_TI4                             (0x1U << GPTIM_CCMR_CCS_Pos)
#define    LL_GPTIM_CC4_MODE_INPUT_TI3                             (0x2U << GPTIM_CCMR_CCS_Pos)
#define    LL_GPTIM_CC_MODE_INPUT_TRC                              (0x3U << GPTIM_CCMR_CCS_Pos)

#define    LL_GPTIM_OC_POLARITY_NOMAL                             (0x0U << GPTIM_CCER_CCOP_Pos)
#define    LL_GPTIM_OC_POLARITY_REVERSE                           (0x1U << GPTIM_CCER_CCOP_Pos)

#define    LL_GPTIM_IC_POLARITY_RISING                            (0x0U << GPTIM_CCER_CCIP_Pos)
#define    LL_GPTIM_IC_POLARITY_FALLING                           (0x1U << GPTIM_CCER_CCIP_Pos)

/**
  * @}
  */
/* Exported functions ---------------------------------------------------------------------------------*/
/** @defgroup GPTIM_LL_Exported_Functions GPTIM Exported Functions
  * @{
  */

/**
  * @brief    
  * @rmtoll   CR1    CKD    LL_GPTIM_SetClockDivision
  * @param    TIMx TIM instance
  * @param    ClockDivision This parameter can be one of the following values:
  *           @arg @ref LL_GPTIM_CLOCKDIVISION_DIV1
  *           @arg @ref LL_GPTIM_CLOCKDIVISION_DIV2
  *           @arg @ref LL_GPTIM_CLOCKDIVISION_DIV4
  * @retval   None
  */
__STATIC_INLINE void LL_GPTIM_SetClockDivision(GPTIM_Type* TIMx, uint32_t ClockDivision)
{
    MODIFY_REG(TIMx->CR1, GPTIM_CR1_CKD_Msk, ClockDivision);
}

/**
  * @brief    
  * @rmtoll   CR1    CKD    LL_GPTIM_GetClockDivision
  * @param    TIMx TIM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_GPTIM_CLOCKDIVISION_DIV1
  *           @arg @ref LL_GPTIM_CLOCKDIVISION_DIV2
  *           @arg @ref LL_GPTIM_CLOCKDIVISION_DIV4
  */
__STATIC_INLINE uint32_t LL_GPTIM_GetClockDivision(GPTIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->CR1, GPTIM_CR1_CKD_Msk));
}

/**
  * @brief    
  * @rmtoll   CR1    ARPE    LL_GPTIM_EnableARRPreload
  * @param    TIMx TIM instance
  * @retval   None
  */
__STATIC_INLINE void LL_GPTIM_EnableARRPreload(GPTIM_Type* TIMx)
{
    SET_BIT(TIMx->CR1, GPTIM_CR1_ARPE_Msk);
}

/**
  * @brief    
  * @rmtoll   CR1    ARPE    LL_GPTIM_IsEnabledARRPreload
  * @param    TIMx TIM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_GPTIM_IsEnabledARRPreload(GPTIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->CR1, GPTIM_CR1_ARPE_Msk) == GPTIM_CR1_ARPE_Msk);
}

/**
  * @brief    
  * @rmtoll   CR1    ARPE    LL_GPTIM_DisableARRPreload
  * @param    TIMx TIM instance
  * @retval   None
  */
__STATIC_INLINE void LL_GPTIM_DisableARRPreload(GPTIM_Type* TIMx)
{
    CLEAR_BIT(TIMx->CR1, GPTIM_CR1_ARPE_Msk);
}

/**
  * @brief    
  * @rmtoll   CR1    CMS    LL_GPTIM_SetCounterAlignedMode
  * @param    TIMx TIM instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref LL_GPTIM_COUNTER_ALIGNED_EDGE
  *           @arg @ref LL_GPTIM_COUNTER_ALIGNED_CENTER_DOWN
  *           @arg @ref LL_GPTIM_COUNTER_ALIGNED_CENTER_UP
  *           @arg @ref LL_GPTIM_COUNTER_ALIGNED_CENTER_UP_DOWN
  * @retval   None
  */
__STATIC_INLINE void LL_GPTIM_SetCounterAlignedMode(GPTIM_Type* TIMx, uint32_t mode)
{
    MODIFY_REG(TIMx->CR1, GPTIM_CR1_CMS_Msk, mode);
}

/**
  * @brief    
  * @rmtoll   CR1    CMS    LL_GPTIM_GetCounterAlignedMode
  * @param    TIMx TIM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_GPTIM_COUNTER_ALIGNED_EDGE
  *           @arg @ref LL_GPTIM_COUNTER_ALIGNED_CENTER_DOWN
  *           @arg @ref LL_GPTIM_COUNTER_ALIGNED_CENTER_UP
  *           @arg @ref LL_GPTIM_COUNTER_ALIGNED_CENTER_UP_DOWN
  */
__STATIC_INLINE uint32_t LL_GPTIM_GetCounterAlignedMode(GPTIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->CR1, GPTIM_CR1_CMS_Msk));
}

/**
  * @brief    
  * @rmtoll   CR1    DIR    LL_GPTIM_SetCounterDirection
  * @param    TIMx TIM instance
  * @param    direct This parameter can be one of the following values:
  *           @arg @ref LL_GPTIM_COUNTER_DIRECT_UP
  *           @arg @ref LL_GPTIM_COUNTER_DIRECT_DOWN
  * @retval   None
  */
__STATIC_INLINE void LL_GPTIM_SetCounterDirection(GPTIM_Type* TIMx, uint32_t direct)
{
    MODIFY_REG(TIMx->CR1, GPTIM_CR1_DIR_Msk, direct);
}

/**
  * @brief    
  * @rmtoll   CR1    DIR    LL_GPTIM_GetCounterDirection
  * @param    TIMx TIM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_GPTIM_COUNTER_DIRECT_UP
  *           @arg @ref LL_GPTIM_COUNTER_DIRECT_DOWN
  */
__STATIC_INLINE uint32_t LL_GPTIM_GetCounterDirection(GPTIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->CR1, GPTIM_CR1_DIR_Msk));
}

/**
  * @brief    
  * @rmtoll   CR1    OPM    LL_GPTIM_SetOnePulseMode
  * @param    TIMx TIM instance
  * @param    OnePulseMode This parameter can be one of the following values:
  *           @arg @ref LL_GPTIM_ONEPULSEMODE_REPETITIVE
  *           @arg @ref LL_GPTIM_ONEPULSEMODE_SINGLE
  * @retval   None
  */
__STATIC_INLINE void LL_GPTIM_SetOnePulseMode(GPTIM_Type* TIMx, uint32_t OnePulseMode)
{
    MODIFY_REG(TIMx->CR1, GPTIM_CR1_OPM_Msk, OnePulseMode);
}

/**
  * @brief    
  * @rmtoll   CR1    OPM    LL_GPTIM_GetOnePulseMode
  * @param    TIMx TIM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_GPTIM_ONEPULSEMODE_REPETITIVE
  *           @arg @ref LL_GPTIM_ONEPULSEMODE_SINGLE
  */
__STATIC_INLINE uint32_t LL_GPTIM_GetOnePulseMode(GPTIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->CR1, GPTIM_CR1_OPM_Msk));
}

/**
  * @brief    
  * @rmtoll   CR1    URS    LL_GPTIM_SetUpdateSource
  * @param    TIMx TIM instance
  * @param    UpdateSource This parameter can be one of the following values:
  *           @arg @ref LL_GPTIM_UPDATESOURCE_REGULAR
  *           @arg @ref LL_GPTIM_UPDATESOURCE_COUNTER
  * @retval   None
  */
__STATIC_INLINE void LL_GPTIM_SetUpdateSource(GPTIM_Type* TIMx, uint32_t UpdateSource)
{
    MODIFY_REG(TIMx->CR1, GPTIM_CR1_URS_Msk, UpdateSource);
}

/**
  * @brief    
  * @rmtoll   CR1    URS    LL_GPTIM_GetUpdateSource
  * @param    TIMx TIM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_GPTIM_UPDATESOURCE_REGULAR
  *           @arg @ref LL_GPTIM_UPDATESOURCE_COUNTER
  */
__STATIC_INLINE uint32_t LL_GPTIM_GetUpdateSource(GPTIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->CR1, GPTIM_CR1_URS_Msk));
}

/**
  * @brief    
  * @rmtoll   CR1    UDIS    LL_GPTIM_EnableUpdateEvent
  * @param    TIMx TIM instance
  * @retval   None
  */
__STATIC_INLINE void LL_GPTIM_EnableUpdateEvent(GPTIM_Type* TIMx)
{
    SET_BIT(TIMx->CR1, GPTIM_CR1_UDIS_Msk);
}

/**
  * @brief    
  * @rmtoll   CR1    UDIS    LL_GPTIM_IsEnabledUpdateEvent
  * @param    TIMx TIM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_GPTIM_IsEnabledUpdateEvent(GPTIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->CR1, GPTIM_CR1_UDIS_Msk) == GPTIM_CR1_UDIS_Msk);
}

/**
  * @brief    
  * @rmtoll   CR1    UDIS    LL_GPTIM_DisableUpdateEvent
  * @param    TIMx TIM instance
  * @retval   None
  */
__STATIC_INLINE void LL_GPTIM_DisableUpdateEvent(GPTIM_Type* TIMx)
{
    CLEAR_BIT(TIMx->CR1, GPTIM_CR1_UDIS_Msk);
}

/**
  * @brief    
  * @rmtoll   CR1    CEN    LL_GPTIM_EnableCounter
  * @param    TIMx TIM instance
  * @retval   None
  */
__STATIC_INLINE void LL_GPTIM_EnableCounter(GPTIM_Type* TIMx)
{
    SET_BIT(TIMx->CR1, GPTIM_CR1_CEN_Msk);
}

/**
  * @brief    
  * @rmtoll   CR1    CEN    LL_GPTIM_IsEnabledCounter
  * @param    TIMx TIM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_GPTIM_IsEnabledCounter(GPTIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->CR1, GPTIM_CR1_CEN_Msk) == GPTIM_CR1_CEN_Msk);
}

/**
  * @brief    
  * @rmtoll   CR1    CEN    LL_GPTIM_DisableCounter
  * @param    TIMx TIM instance
  * @retval   None
  */
__STATIC_INLINE void LL_GPTIM_DisableCounter(GPTIM_Type* TIMx)
{
    CLEAR_BIT(TIMx->CR1, GPTIM_CR1_CEN_Msk);
}

/**
  * @brief    
  * @rmtoll   CR2    MMS    LL_GPTIM_SetTriggerOutput
  * @param    TIMx TIM instance
  * @param    TimerSynchronization This parameter can be one of the following values:
  *           @arg @ref LL_GPTIM_TRGO_RESET
  *           @arg @ref LL_GPTIM_TRGO_ENABLE
  *           @arg @ref LL_GPTIM_TRGO_UPDATE
  *           @arg @ref LL_GPTIM_TRGO_CC1IF
  *           @arg @ref LL_GPTIM_TRGO_OC1REF
  *           @arg @ref LL_GPTIM_TRGO_OC2REF
  *           @arg @ref LL_GPTIM_TRGO_OC3REF
  *           @arg @ref LL_GPTIM_TRGO_OC4REF
  * @retval   None
  */
__STATIC_INLINE void LL_GPTIM_SetTriggerOutput(GPTIM_Type* TIMx, uint32_t TimerSynchronization)
{
    MODIFY_REG(TIMx->CR2, GPTIM_CR2_MMS_Msk, TimerSynchronization);
}

/**
  * @brief    
  * @rmtoll   CR2    MMS    LL_GPTIM_GetTriggerOutput
  * @param    TIMx TIM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_GPTIM_TRGO_RESET
  *           @arg @ref LL_GPTIM_TRGO_ENABLE
  *           @arg @ref LL_GPTIM_TRGO_UPDATE
  *           @arg @ref LL_GPTIM_TRGO_CC1IF
  *           @arg @ref LL_GPTIM_TRGO_OC1REF
  *           @arg @ref LL_GPTIM_TRGO_OC2REF
  *           @arg @ref LL_GPTIM_TRGO_OC3REF
  *           @arg @ref LL_GPTIM_TRGO_OC4REF
  */
__STATIC_INLINE uint32_t LL_GPTIM_GetTriggerOutput(GPTIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->CR2, GPTIM_CR2_MMS_Msk));
}

/**
  * @brief    
  * @rmtoll   CR2    CCDS    LL_GPTIM_CC_SetDMAReqTrigger
  * @param    TIMx TIM instance
  * @param    DMAReqTrigger This parameter can be one of the following values:
  *           @arg @ref LL_GPTIM_CCDMAREQUEST_CC
  *           @arg @ref LL_GPTIM_CCDMAREQUEST_UPDATE
  * @retval   None
  */
__STATIC_INLINE void LL_GPTIM_CC_SetDMAReqTrigger(GPTIM_Type* TIMx, uint32_t DMAReqTrigger)
{
    MODIFY_REG(TIMx->CR2, GPTIM_CR2_CCDS_Msk, DMAReqTrigger);
}

/**
  * @brief    
  * @rmtoll   CR2    CCDS    LL_GPTIM_CC_GetDMAReqTrigger
  * @param    TIMx TIM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_GPTIM_CCDMAREQUEST_CC
  *           @arg @ref LL_GPTIM_CCDMAREQUEST_UPDATE
  */
__STATIC_INLINE uint32_t LL_GPTIM_CC_GetDMAReqTrigger(GPTIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->CR2, GPTIM_CR2_CCDS_Msk));
}

/**
  * @brief    
  * @rmtoll   SMCR    ETP    LL_GPTIM_SetETRPolarity
  * @param    TIMx TIM instance
  * @param    Polarity This parameter can be one of the following values:
  *           @arg @ref LL_GPTIM_ETR_POLARITY_NONINVERTED
  *           @arg @ref LL_GPTIM_ETR_POLARITY_NINVERTED
  * @retval   None
  */
__STATIC_INLINE void LL_GPTIM_SetETRPolarity(GPTIM_Type* TIMx, uint32_t Polarity)
{
    MODIFY_REG(TIMx->SMCR, GPTIM_SMCR_ETP_Msk, Polarity);
}

/**
  * @brief    
  * @rmtoll   SMCR    ETP    LL_GPTIM_GetETRPolarity
  * @param    TIMx TIM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_GPTIM_ETR_POLARITY_NONINVERTED
  *           @arg @ref LL_GPTIM_ETR_POLARITY_NINVERTED
  */
__STATIC_INLINE uint32_t LL_GPTIM_GetETRPolarity(GPTIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->SMCR, GPTIM_SMCR_ETP_Msk));
}

/**
  * @brief    
  * @rmtoll   SMCR    ECE    LL_GPTIM_EnableExternalClock
  * @param    TIMx TIM instance
  * @retval   None
  */
__STATIC_INLINE void LL_GPTIM_EnableExternalClock(GPTIM_Type* TIMx)
{
    SET_BIT(TIMx->SMCR, GPTIM_SMCR_ECE_Msk);
}

/**
  * @brief    
  * @rmtoll   SMCR    ECE    LL_GPTIM_IsEnabledExternalClock
  * @param    TIMx TIM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_GPTIM_IsEnabledExternalClock(GPTIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->SMCR, GPTIM_SMCR_ECE_Msk) == GPTIM_SMCR_ECE_Msk);
}

/**
  * @brief    
  * @rmtoll   SMCR    ECE    LL_GPTIM_DisableExternalClock
  * @param    TIMx TIM instance
  * @retval   None
  */
__STATIC_INLINE void LL_GPTIM_DisableExternalClock(GPTIM_Type* TIMx)
{
    CLEAR_BIT(TIMx->SMCR, GPTIM_SMCR_ECE_Msk);
}

/**
  * @brief    
  * @rmtoll   SMCR    ETPS    LL_GPTIM_SetETRExtrenalTriggerPsc
  * @param    TIMx TIM instance
  * @param    Psc This parameter can be one of the following values:
  *           @arg @ref LL_GPTIM_ETR_PRESCALER_DIV1
  *           @arg @ref LL_GPTIM_ETR_PRESCALER_DIV2
  *           @arg @ref LL_GPTIM_ETR_PRESCALER_DIV4
  *           @arg @ref LL_GPTIM_ETR_PRESCALER_DIV8
  * @retval   None
  */
__STATIC_INLINE void LL_GPTIM_SetETRExtrenalTriggerPsc(GPTIM_Type* TIMx, uint32_t Psc)
{
    MODIFY_REG(TIMx->SMCR, GPTIM_SMCR_ETPS_Msk, Psc);
}

/**
  * @brief    
  * @rmtoll   SMCR    ETPS    LL_GPTIM_GetETRExtrenalTriggerPsc
  * @param    TIMx TIM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_GPTIM_ETR_PRESCALER_DIV1
  *           @arg @ref LL_GPTIM_ETR_PRESCALER_DIV2
  *           @arg @ref LL_GPTIM_ETR_PRESCALER_DIV4
  *           @arg @ref LL_GPTIM_ETR_PRESCALER_DIV8
  */
__STATIC_INLINE uint32_t LL_GPTIM_GetETRExtrenalTriggerPsc(GPTIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->SMCR, GPTIM_SMCR_ETPS_Msk));
}

/**
  * @brief    
  * @rmtoll   SMCR    ETF    LL_GPTIM_SetETRExtrenalTriggerFilter
  * @param    TIMx TIM instance
  * @param    Filter This parameter can be one of the following values:
  *           @arg @ref LL_GPTIM_ETR_FILTER_FDIV1
  *           @arg @ref LL_GPTIM_ETR_FILTER_FDIV1_N2
  *           @arg @ref LL_GPTIM_ETR_FILTER_FDIV1_N4
  *           @arg @ref LL_GPTIM_ETR_FILTER_FDIV1_N8
  *           @arg @ref LL_GPTIM_ETR_FILTER_FDIV2_N6
  *           @arg @ref LL_GPTIM_ETR_FILTER_FDIV2_N8
  *           @arg @ref LL_GPTIM_ETR_FILTER_FDIV4_N6
  *           @arg @ref LL_GPTIM_ETR_FILTER_FDIV4_N8
  *           @arg @ref LL_GPTIM_ETR_FILTER_FDIV8_N6
  *           @arg @ref LL_GPTIM_ETR_FILTER_FDIV8_N8
  *           @arg @ref LL_GPTIM_ETR_FILTER_FDIV16_N5
  *           @arg @ref LL_GPTIM_ETR_FILTER_FDIV16_N6
  *           @arg @ref LL_GPTIM_ETR_FILTER_FDIV16_N8
  *           @arg @ref LL_GPTIM_ETR_FILTER_FDIV32_N5
  *           @arg @ref LL_GPTIM_ETR_FILTER_FDIV32_N6
  *           @arg @ref LL_GPTIM_ETR_FILTER_FDIV32_N8
  * @retval   None
  */
__STATIC_INLINE void LL_GPTIM_SetETRExtrenalTriggerFilter(GPTIM_Type* TIMx, uint32_t Filter)
{
    MODIFY_REG(TIMx->SMCR, GPTIM_SMCR_ETF_Msk, Filter);
}

/**
  * @brief    
  * @rmtoll   SMCR    ETF    LL_GPTIM_GetETRExtrenalTriggerFilter
  * @param    TIMx TIM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_GPTIM_ETR_FILTER_FDIV1
  *           @arg @ref LL_GPTIM_ETR_FILTER_FDIV1_N2
  *           @arg @ref LL_GPTIM_ETR_FILTER_FDIV1_N4
  *           @arg @ref LL_GPTIM_ETR_FILTER_FDIV1_N8
  *           @arg @ref LL_GPTIM_ETR_FILTER_FDIV2_N6
  *           @arg @ref LL_GPTIM_ETR_FILTER_FDIV2_N8
  *           @arg @ref LL_GPTIM_ETR_FILTER_FDIV4_N6
  *           @arg @ref LL_GPTIM_ETR_FILTER_FDIV4_N8
  *           @arg @ref LL_GPTIM_ETR_FILTER_FDIV8_N6
  *           @arg @ref LL_GPTIM_ETR_FILTER_FDIV8_N8
  *           @arg @ref LL_GPTIM_ETR_FILTER_FDIV16_N5
  *           @arg @ref LL_GPTIM_ETR_FILTER_FDIV16_N6
  *           @arg @ref LL_GPTIM_ETR_FILTER_FDIV16_N8
  *           @arg @ref LL_GPTIM_ETR_FILTER_FDIV32_N5
  *           @arg @ref LL_GPTIM_ETR_FILTER_FDIV32_N6
  *           @arg @ref LL_GPTIM_ETR_FILTER_FDIV32_N8
  */
__STATIC_INLINE uint32_t LL_GPTIM_GetETRExtrenalTriggerFilter(GPTIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->SMCR, GPTIM_SMCR_ETF_Msk));
}

/**
  * @brief    
  * @rmtoll   SMCR    MSM    LL_GPTIM_EnableMasterSlaveMode
  * @param    TIMx TIM instance
  * @retval   None
  */
__STATIC_INLINE void LL_GPTIM_EnableMasterSlaveMode(GPTIM_Type* TIMx)
{
    SET_BIT(TIMx->SMCR, GPTIM_SMCR_MSM_Msk);
}

/**
  * @brief    
  * @rmtoll   SMCR    MSM    LL_GPTIM_IsEnabledMasterSlaveMode
  * @param    TIMx TIM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_GPTIM_IsEnabledMasterSlaveMode(GPTIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->SMCR, GPTIM_SMCR_MSM_Msk) == GPTIM_SMCR_MSM_Msk);
}

/**
  * @brief    
  * @rmtoll   SMCR    MSM    LL_GPTIM_DisableMasterSlaveMode
  * @param    TIMx TIM instance
  * @retval   None
  */
__STATIC_INLINE void LL_GPTIM_DisableMasterSlaveMode(GPTIM_Type* TIMx)
{
    CLEAR_BIT(TIMx->SMCR, GPTIM_SMCR_MSM_Msk);
}

/**
  * @brief    
  * @rmtoll   SMCR    TS    LL_GPTIM_SetTriggerInput
  * @param    TIMx TIM instance
  * @param    TriggerInput This parameter can be one of the following values:
  *           @arg @ref LL_GPTIM_TIM_TS_ITR0
  *           @arg @ref LL_GPTIM_TIM_TS_ITR1
  *           @arg @ref LL_GPTIM_TIM_TS_ITR2
  *           @arg @ref LL_GPTIM_TIM_TS_ITR3
  *           @arg @ref LL_GPTIM_TIM_TS_TI1F_ED
  *           @arg @ref LL_GPTIM_TIM_TS_TI1FP1
  *           @arg @ref LL_GPTIM_TIM_TS_TI2FP1
  *           @arg @ref LL_GPTIM_TIM_TS_ETRF
  * @retval   None
  */
__STATIC_INLINE void LL_GPTIM_SetTriggerInput(GPTIM_Type* TIMx, uint32_t TriggerInput)
{
    MODIFY_REG(TIMx->SMCR, GPTIM_SMCR_TS_Msk, TriggerInput);
}

/**
  * @brief    
  * @rmtoll   SMCR    TS    LL_GPTIM_GetTriggerInput
  * @param    TIMx TIM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_GPTIM_TIM_TS_ITR0
  *           @arg @ref LL_GPTIM_TIM_TS_ITR1
  *           @arg @ref LL_GPTIM_TIM_TS_ITR2
  *           @arg @ref LL_GPTIM_TIM_TS_ITR3
  *           @arg @ref LL_GPTIM_TIM_TS_TI1F_ED
  *           @arg @ref LL_GPTIM_TIM_TS_TI1FP1
  *           @arg @ref LL_GPTIM_TIM_TS_TI2FP1
  *           @arg @ref LL_GPTIM_TIM_TS_ETRF
  */
__STATIC_INLINE uint32_t LL_GPTIM_GetTriggerInput(GPTIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->SMCR, GPTIM_SMCR_TS_Msk));
}

/**
  * @brief    
  * @rmtoll   SMCR    SMS    LL_GPTIM_SetSlaveMode
  * @param    TIMx TIM instance
  * @param    EncoderMode This parameter can be one of the following values:
  *           @arg @ref LL_GPTIM_SLAVE_MODE_PROHIBITED
  *           @arg @ref LL_GPTIM_SLAVE_MODE_TI1FP1_TI2FP2_CNT
  *           @arg @ref LL_GPTIM_SLAVE_MODE_TI2FP2_TI1FP1_CNT
  *           @arg @ref LL_GPTIM_SLAVE_MODE_TI2FP2_CNT_TI1FP1_CNT
  *           @arg @ref LL_GPTIM_SLAVE_MODE_TRGI_RISE_RST
  *           @arg @ref LL_GPTIM_SLAVE_MODE_TRGI_HIGH_RUN
  *           @arg @ref LL_GPTIM_SLAVE_MODE_TRGI_RISE_RUN
  *           @arg @ref LL_GPTIM_SLAVE_MODE_TRGI_CLK
  * @retval   None
  */
__STATIC_INLINE void LL_GPTIM_SetSlaveMode(GPTIM_Type* TIMx, uint32_t EncoderMode)
{
    MODIFY_REG(TIMx->SMCR, GPTIM_SMCR_SMS_Msk, EncoderMode);
}

