xdu-aero-association/FM33LC0XX_Example_0.04/COMP 比较器 休眠中断/Drivers/FM33LC0xx_LL_Driver/Inc/fm33lc0xx_ll_gptim.h
/**
  * @brief    
  * @rmtoll   SMCR    SMS    LL_GPTIM_GetSlaveMode
  * @param    TIMx TIM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_GPTIM_SLAVE_MODE_PROHIBITED
  *           @arg @ref LL_GPTIM_SLAVE_MODE_TI1FP1_TI2FP2_CNT
  *           @arg @ref LL_GPTIM_SLAVE_MODE_TI2FP2_TI1FP1_CNT
  *           @arg @ref LL_GPTIM_SLAVE_MODE_TI2FP2_CNT_TI1FP1_CNT
  *           @arg @ref LL_GPTIM_SLAVE_MODE_TRGI_RISE_RST
  *           @arg @ref LL_GPTIM_SLAVE_MODE_TRGI_HIGH_RUN
  *           @arg @ref LL_GPTIM_SLAVE_MODE_TRGI_RISE_RUN
  *           @arg @ref LL_GPTIM_SLAVE_MODE_TRGI_CLK
  */
__STATIC_INLINE uint32_t LL_GPTIM_GetSlaveMode(GPTIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->SMCR, GPTIM_SMCR_SMS_Msk));
}

/**
  * @brief    
  * @rmtoll   DIER    CC1BURSTEN    LL_GPTIM_EnableCC1BurstMode
  * @param    TIMx TIM instance
  * @retval   None
  */
__STATIC_INLINE void LL_GPTIM_EnableCC1BurstMode(GPTIM_Type* TIMx)
{
    SET_BIT(TIMx->DIER, GPTIM_DIER_CC1BURSTEN_Msk);
}

/**
  * @brief    
  * @rmtoll   DIER    CC1BURSTEN    LL_GPTIM_IsEnabledCC1BurstMode
  * @param    TIMx TIM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_GPTIM_IsEnabledCC1BurstMode(GPTIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->DIER, GPTIM_DIER_CC1BURSTEN_Msk) == GPTIM_DIER_CC1BURSTEN_Msk);
}

/**
  * @brief    
  * @rmtoll   DIER    CC1BURSTEN    LL_GPTIM_DisableCC1BurstMode
  * @param    TIMx TIM instance
  * @retval   None
  */
__STATIC_INLINE void LL_GPTIM_DisableCC1BurstMode(GPTIM_Type* TIMx)
{
    CLEAR_BIT(TIMx->DIER, GPTIM_DIER_CC1BURSTEN_Msk);
}

/**
  * @brief    
  * @rmtoll   DIER    CC2BURSTEN    LL_GPTIM_EnableCC2BurstMode
  * @param    TIMx TIM instance
  * @retval   None
  */
__STATIC_INLINE void LL_GPTIM_EnableCC2BurstMode(GPTIM_Type* TIMx)
{
    SET_BIT(TIMx->DIER, GPTIM_DIER_CC2BURSTEN_Msk);
}

/**
  * @brief    
  * @rmtoll   DIER    CC2BURSTEN    LL_GPTIM_IsEnabledCC2BurstMode
  * @param    TIMx TIM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_GPTIM_IsEnabledCC2BurstMode(GPTIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->DIER, GPTIM_DIER_CC2BURSTEN_Msk) == GPTIM_DIER_CC2BURSTEN_Msk);
}

/**
  * @brief    
  * @rmtoll   DIER    CC2BURSTEN    LL_GPTIM_DisableCC2BurstMode
  * @param    TIMx TIM instance
  * @retval   None
  */
__STATIC_INLINE void LL_GPTIM_DisableCC2BurstMode(GPTIM_Type* TIMx)
{
    CLEAR_BIT(TIMx->DIER, GPTIM_DIER_CC2BURSTEN_Msk);
}

/**
  * @brief    
  * @rmtoll   DIER    CC3BURSTEN    LL_GPTIM_EnableCC3BurstMode
  * @param    TIMx TIM instance
  * @retval   None
  */
__STATIC_INLINE void LL_GPTIM_EnableCC3BurstMode(GPTIM_Type* TIMx)
{
    SET_BIT(TIMx->DIER, GPTIM_DIER_CC3BURSTEN_Msk);
}

/**
  * @brief    
  * @rmtoll   DIER    CC3BURSTEN    LL_GPTIM_IsEnabledCC3BurstMode
  * @param    TIMx TIM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_GPTIM_IsEnabledCC3BurstMode(GPTIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->DIER, GPTIM_DIER_CC3BURSTEN_Msk) == GPTIM_DIER_CC3BURSTEN_Msk);
}

/**
  * @brief    
  * @rmtoll   DIER    CC3BURSTEN    LL_GPTIM_DisableCC3BurstMode
  * @param    TIMx TIM instance
  * @retval   None
  */
__STATIC_INLINE void LL_GPTIM_DisableCC3BurstMode(GPTIM_Type* TIMx)
{
    CLEAR_BIT(TIMx->DIER, GPTIM_DIER_CC3BURSTEN_Msk);
}

/**
  * @brief    
  * @rmtoll   DIER    CC4BURSTEN    LL_GPTIM_EnableCC4BurstMode
  * @param    TIMx TIM instance
  * @retval   None
  */
__STATIC_INLINE void LL_GPTIM_EnableCC4BurstMode(GPTIM_Type* TIMx)
{
    SET_BIT(TIMx->DIER, GPTIM_DIER_CC4BURSTEN_Msk);
}

/**
  * @brief    
  * @rmtoll   DIER    CC4BURSTEN    LL_GPTIM_IsEnabledCC4BurstMode
  * @param    TIMx TIM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_GPTIM_IsEnabledCC4BurstMode(GPTIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->DIER, GPTIM_DIER_CC4BURSTEN_Msk) == GPTIM_DIER_CC4BURSTEN_Msk);
}

/**
  * @brief    
  * @rmtoll   DIER    CC4BURSTEN    LL_GPTIM_DisableCC4BurstMode
  * @param    TIMx TIM instance
  * @retval   None
  */
__STATIC_INLINE void LL_GPTIM_DisableCC4BurstMode(GPTIM_Type* TIMx)
{
    CLEAR_BIT(TIMx->DIER, GPTIM_DIER_CC4BURSTEN_Msk);
}

/**
  * @brief    
  * @rmtoll   DIER    TDE    LL_GPTIM_EnableDMAReq_TRIG
  * @param    TIMx TIM instance
  * @retval   None
  */
__STATIC_INLINE void LL_GPTIM_EnableDMAReq_TRIG(GPTIM_Type* TIMx)
{
    SET_BIT(TIMx->DIER, GPTIM_DIER_TDE_Msk);
}

/**
  * @brief    
  * @rmtoll   DIER    TDE    LL_GPTIM_IsEnabledDMAReq_TRIG
  * @param    TIMx TIM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_GPTIM_IsEnabledDMAReq_TRIG(GPTIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->DIER, GPTIM_DIER_TDE_Msk) == GPTIM_DIER_TDE_Msk);
}

/**
  * @brief    
  * @rmtoll   DIER    TDE    LL_GPTIM_DisableDMAReq_TRIG
  * @param    TIMx TIM instance
  * @retval   None
  */
__STATIC_INLINE void LL_GPTIM_DisableDMAReq_TRIG(GPTIM_Type* TIMx)
{
    CLEAR_BIT(TIMx->DIER, GPTIM_DIER_TDE_Msk);
}

/**
  * @brief    
  * @rmtoll   DIER    CCDE    LL_GPTIM_EnableDMAReq
  * @param    TIMx TIM instance
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_GPTIM_CHANNEL_1
  *           @arg @ref LL_GPTIM_CHANNEL_2
  *           @arg @ref LL_GPTIM_CHANNEL_3
  *           @arg @ref LL_GPTIM_CHANNEL_4
  * @retval   None
  */
__STATIC_INLINE void LL_GPTIM_EnableDMAReq(GPTIM_Type* TIMx, uint32_t Channel)
{
    SET_BIT(TIMx->DIER, GPTIM_DIER_CCDE_Msk << Channel ); 
}

/**
  * @brief    
  * @rmtoll   DIER    CCDE    LL_GPTIM_IsEnabledDMAReq
  * @param    TIMx TIM instance
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_GPTIM_CHANNEL_1
  *           @arg @ref LL_GPTIM_CHANNEL_2
  *           @arg @ref LL_GPTIM_CHANNEL_3
  *           @arg @ref LL_GPTIM_CHANNEL_4
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_GPTIM_IsEnabledDMAReq(GPTIM_Type* TIMx, uint32_t Channel)
{
    return (uint32_t)(READ_BIT(TIMx->DIER, (GPTIM_DIER_CCDE_Msk << Channel)) == (GPTIM_DIER_CCDE_Msk << Channel)); 
}

/**
  * @brief    
  * @rmtoll   DIER    CCDE    LL_GPTIM_DisableDMAReq
  * @param    TIMx TIM instance
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_GPTIM_CHANNEL_1
  *           @arg @ref LL_GPTIM_CHANNEL_2
  *           @arg @ref LL_GPTIM_CHANNEL_3
  *           @arg @ref LL_GPTIM_CHANNEL_4
  * @retval   None
  */
__STATIC_INLINE void LL_GPTIM_DisableDMAReq(GPTIM_Type* TIMx, uint32_t Channel)
{
    CLEAR_BIT(TIMx->DIER, GPTIM_DIER_CCDE_Msk << Channel); 
}

/**
  * @brief    
  * @rmtoll   DIER    UDE    LL_GPTIM_EnableDMAReq_UPDATE
  * @param    TIMx TIM instance
  * @retval   None
  */
__STATIC_INLINE void LL_GPTIM_EnableDMAReq_UPDATE(GPTIM_Type* TIMx)
{
    SET_BIT(TIMx->DIER, GPTIM_DIER_UDE_Msk);
}

/**
  * @brief    
  * @rmtoll   DIER    UDE    LL_GPTIM_IsEnabledDMAReq_UPDATE
  * @param    TIMx TIM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_GPTIM_IsEnabledDMAReq_UPDATE(GPTIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->DIER, GPTIM_DIER_UDE_Msk) == GPTIM_DIER_UDE_Msk);
}

/**
  * @brief    
  * @rmtoll   DIER    UDE    LL_GPTIM_DisableDMAReq_UPDATE
  * @param    TIMx TIM instance
  * @retval   None
  */
__STATIC_INLINE void LL_GPTIM_DisableDMAReq_UPDATE(GPTIM_Type* TIMx)
{
    CLEAR_BIT(TIMx->DIER, GPTIM_DIER_UDE_Msk);
}

/**
  * @brief    
  * @rmtoll   DIER    TIE    LL_GPTIM_EnableIT_TRIG
  * @param    TIMx TIM instance
  * @retval   None
  */
__STATIC_INLINE void LL_GPTIM_EnableIT_TRIG(GPTIM_Type* TIMx)
{
    SET_BIT(TIMx->DIER, GPTIM_DIER_TIE_Msk);
}

/**
  * @brief    
  * @rmtoll   DIER    TIE    LL_GPTIM_IsEnabledIT_TRIG
  * @param    TIMx TIM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_GPTIM_IsEnabledIT_TRIG(GPTIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->DIER, GPTIM_DIER_TIE_Msk) == GPTIM_DIER_TIE_Msk);
}

/**
  * @brief    
  * @rmtoll   DIER    TIE    LL_GPTIM_DisableIT_TRIG
  * @param    TIMx TIM instance
  * @retval   None
  */
__STATIC_INLINE void LL_GPTIM_DisableIT_TRIG(GPTIM_Type* TIMx)
{
    CLEAR_BIT(TIMx->DIER, GPTIM_DIER_TIE_Msk);
}

/**
  * @brief    
  * @rmtoll   DIER    CCIE    LL_GPTIM_EnableIT_CC
  * @param    TIMx TIM instance
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_GPTIM_CHANNEL_1
  *           @arg @ref LL_GPTIM_CHANNEL_2
  *           @arg @ref LL_GPTIM_CHANNEL_3
  *           @arg @ref LL_GPTIM_CHANNEL_4
  * @retval   None
  */
__STATIC_INLINE void LL_GPTIM_EnableIT_CC(GPTIM_Type* TIMx, uint32_t Channel)
{
    SET_BIT(TIMx->DIER, GPTIM_DIER_CCIE_Msk << Channel ); 
}

/**
  * @brief    
  * @rmtoll   DIER    CCIE    LL_GPTIM_IsEnabledIT_CC
  * @param    TIMx TIM instance
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_GPTIM_CHANNEL_1
  *           @arg @ref LL_GPTIM_CHANNEL_2
  *           @arg @ref LL_GPTIM_CHANNEL_3
  *           @arg @ref LL_GPTIM_CHANNEL_4
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_GPTIM_IsEnabledIT_CC(GPTIM_Type* TIMx, uint32_t Channel)
{
    return (uint32_t)(READ_BIT(TIMx->DIER,(GPTIM_DIER_CCIE_Msk << Channel )) == (GPTIM_DIER_CCIE_Msk << Channel)); 
}

/**
  * @brief    
  * @rmtoll   DIER    CCIE    LL_GPTIM_DisableIT_CC
  * @param    TIMx TIM instance
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_GPTIM_CHANNEL_1
  *           @arg @ref LL_GPTIM_CHANNEL_2
  *           @arg @ref LL_GPTIM_CHANNEL_3
  *           @arg @ref LL_GPTIM_CHANNEL_4
  * @retval   None
  */
__STATIC_INLINE void LL_GPTIM_DisableIT_CC(GPTIM_Type* TIMx, uint32_t Channel)
{
    CLEAR_BIT(TIMx->DIER, GPTIM_DIER_CCIE_Msk << Channel ); 
}

/**
  * @brief    
  * @rmtoll   DIER    UIE    LL_GPTIM_EnableIT_UPDATE
  * @param    TIMx TIM instance
  * @retval   None
  */
__STATIC_INLINE void LL_GPTIM_EnableIT_UPDATE(GPTIM_Type* TIMx)
{
    SET_BIT(TIMx->DIER, GPTIM_DIER_UIE_Msk);
}

/**
  * @brief    
  * @rmtoll   DIER    UIE    LL_GPTIM_IsEnabledIT_UPDATE
  * @param    TIMx TIM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_GPTIM_IsEnabledIT_UPDATE(GPTIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->DIER, GPTIM_DIER_UIE_Msk) == GPTIM_DIER_UIE_Msk);
}

/**
  * @brief    
  * @rmtoll   DIER    UIE    LL_GPTIM_DisableIT_UPDATE
  * @param    TIMx TIM instance
  * @retval   None
  */
__STATIC_INLINE void LL_GPTIM_DisableIT_UPDATE(GPTIM_Type* TIMx)
{
    CLEAR_BIT(TIMx->DIER, GPTIM_DIER_UIE_Msk);
}

/**
  * @brief    
  * @rmtoll   ISR    CCOF    LL_GPTIM_IsActiveFlag_CCOVR
  * @param    TIMx TIM instance
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_GPTIM_CHANNEL_1
  *           @arg @ref LL_GPTIM_CHANNEL_2
  *           @arg @ref LL_GPTIM_CHANNEL_3
  *           @arg @ref LL_GPTIM_CHANNEL_4
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_GPTIM_IsActiveFlag_CCOVR(GPTIM_Type* TIMx, uint32_t Channel)
{
    return (uint32_t)(READ_BIT(TIMx->ISR, (GPTIM_ISR_CCOF_Msk << Channel)) == (GPTIM_ISR_CCOF_Msk << Channel)); 
}

/**
  * @brief    
  * @rmtoll   ISR    CCOF    LL_GPTIM_ClearFlag_CCOVR
  * @param    TIMx TIM instance
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_GPTIM_CHANNEL_1
  *           @arg @ref LL_GPTIM_CHANNEL_2
  *           @arg @ref LL_GPTIM_CHANNEL_3
  *           @arg @ref LL_GPTIM_CHANNEL_4
  * @retval   None
  */
__STATIC_INLINE void LL_GPTIM_ClearFlag_CCOVR(GPTIM_Type* TIMx, uint32_t Channel)
{
    WRITE_REG(TIMx->ISR, (GPTIM_ISR_CCOF_Msk << Channel)); 
}

/**
  * @brief    
  * @rmtoll   ISR    TIF    LL_GPTIM_IsActiveFlag_TRIG
  * @param    TIMx TIM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_GPTIM_IsActiveFlag_TRIG(GPTIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->ISR, GPTIM_ISR_TIF_Msk) == (GPTIM_ISR_TIF_Msk));
}

/**
  * @brief    
  * @rmtoll   ISR    TIF    LL_GPTIM_ClearFlag_TRIG
  * @param    TIMx TIM instance
  * @retval   None
  */
__STATIC_INLINE void LL_GPTIM_ClearFlag_TRIG(GPTIM_Type* TIMx)
{
    WRITE_REG(TIMx->ISR, GPTIM_ISR_TIF_Msk); 
}

/**
  * @brief    
  * @rmtoll   ISR    CCIF    LL_GPTIM_IsActiveFlag_CC
  * @param    TIMx TIM instance
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_GPTIM_CHANNEL_1
  *           @arg @ref LL_GPTIM_CHANNEL_2
  *           @arg @ref LL_GPTIM_CHANNEL_3
  *           @arg @ref LL_GPTIM_CHANNEL_4
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_GPTIM_IsActiveFlag_CC(GPTIM_Type* TIMx, uint32_t Channel)
{
    return (uint32_t)(READ_BIT(TIMx->ISR, (GPTIM_ISR_CCIF_Msk << Channel)) == (GPTIM_ISR_CCIF_Msk << Channel)); 
}

/**
  * @brief    
  * @rmtoll   ISR    CCIF    LL_GPTIM_ClearFlag_CC
  * @param    TIMx TIM instance
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_GPTIM_CHANNEL_1
  *           @arg @ref LL_GPTIM_CHANNEL_2
  *           @arg @ref LL_GPTIM_CHANNEL_3
  *           @arg @ref LL_GPTIM_CHANNEL_4
  * @retval   None
  */
__STATIC_INLINE void LL_GPTIM_ClearFlag_CC(GPTIM_Type* TIMx, uint32_t Channel)
{
    WRITE_REG(TIMx->ISR, (GPTIM_ISR_CCIF_Msk << Channel)); 
}

/**
  * @brief    
  * @rmtoll   ISR    UIF    LL_GPTIM_IsActiveFlag_UPDATE
  * @param    TIMx TIM instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_GPTIM_IsActiveFlag_UPDATE(GPTIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->ISR, GPTIM_ISR_UIF_Msk) == (GPTIM_ISR_UIF_Msk));
}

/**
  * @brief    
  * @rmtoll   ISR    UIF    LL_GPTIM_ClearFlag_UPDATE
  * @param    TIMx TIM instance
  * @retval   None
  */
__STATIC_INLINE void LL_GPTIM_ClearFlag_UPDATE(GPTIM_Type* TIMx)
{
    WRITE_REG(TIMx->ISR, GPTIM_ISR_UIF_Msk);
}

/**
  * @brief    
  * @rmtoll   EGR    TG    LL_GPTIM_GenerateEvent_TRIG
  * @param    TIMx TIM instance
  * @retval   None
  */
__STATIC_INLINE void LL_GPTIM_GenerateEvent_TRIG(GPTIM_Type* TIMx)
{
    SET_BIT(TIMx->EGR, GPTIM_EGR_TG_Msk);
}

/**
  * @brief    
  * @rmtoll   EGR    CCG    LL_GPTIM_GenerateEvent
  * @param    TIMx TIM instance
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_GPTIM_CHANNEL_1
  *           @arg @ref LL_GPTIM_CHANNEL_2
  *           @arg @ref LL_GPTIM_CHANNEL_3
  *           @arg @ref LL_GPTIM_CHANNEL_4
  * @retval   None
  */
__STATIC_INLINE void LL_GPTIM_GenerateEvent(GPTIM_Type* TIMx, uint32_t Channel)
{
    SET_BIT(TIMx->EGR,GPTIM_EGR_CCG_Msk << Channel );
}

/**
  * @brief    
  * @rmtoll   EGR    UG    LL_GPTIM_GenerateEvent_UPDATE
  * @param    TIMx TIM instance
  * @retval   None
  */
__STATIC_INLINE void LL_GPTIM_GenerateEvent_UPDATE(GPTIM_Type* TIMx)
{
    SET_BIT(TIMx->EGR, GPTIM_EGR_UG_Msk);
}

/**
  * @brief    
  * @rmtoll   CNT        LL_GPTIM_SetCounter
  * @param    TIMx TIM instance
  * @param    counter 
  * @retval   None
  */
__STATIC_INLINE void LL_GPTIM_SetCounter(GPTIM_Type* TIMx, uint32_t counter)
{
    MODIFY_REG(TIMx->CNT, (0xffffU << 0U), (counter << 0U));
}

/**
  * @brief    
  * @rmtoll   CNT        LL_GPTIM_GetCounter
  * @param    TIMx TIM instance
  * @retval   
  */
__STATIC_INLINE uint32_t LL_GPTIM_GetCounter(GPTIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->CNT, 0xffffU) >> 0U);
}

/**
  * @brief    
  * @rmtoll   PSC        LL_GPTIM_SetPrescaler
  * @param    TIMx TIM instance
  * @param    Prescaler 
  * @retval   None
  */
__STATIC_INLINE void LL_GPTIM_SetPrescaler(GPTIM_Type* TIMx, uint32_t Prescaler)
{
    MODIFY_REG(TIMx->PSC, (0xffffU << 0U), (Prescaler << 0U));
}

/**
  * @brief    
  * @rmtoll   PSC        LL_GPTIM_GetPrescaler
  * @param    TIMx TIM instance
  * @retval   
  */
__STATIC_INLINE uint32_t LL_GPTIM_GetPrescaler(GPTIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->PSC, 0xffffU) >> 0U);
}

/**
  * @brief    
  * @rmtoll   ARR        LL_GPTIM_SetAutoReload
  * @param    TIMx TIM instance
  * @param    AutoReload 
  * @retval   None
  */
__STATIC_INLINE void LL_GPTIM_SetAutoReload(GPTIM_Type* TIMx, uint32_t AutoReload)
{
    MODIFY_REG(TIMx->ARR, (0xffffU << 0U), (AutoReload << 0U));
}

/**
  * @brief    
  * @rmtoll   ARR        LL_GPTIM_GetAutoReload
  * @param    TIMx TIM instance
  * @retval   
  */
__STATIC_INLINE uint32_t LL_GPTIM_GetAutoReload(GPTIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->ARR, 0xffffU) >> 0U);
}

/**
  * @brief    
  * @rmtoll   CCR1        LL_GPTIM_SetCompareCH1
  * @param    TIMx TIM instance
  * @param    CompareValue 
  * @retval   None
  */
__STATIC_INLINE void LL_GPTIM_SetCompareCH1(GPTIM_Type* TIMx, uint32_t CompareValue)
{
    MODIFY_REG(TIMx->CCR1, (0xffffU << 0U), (CompareValue << 0U));
}

/**
  * @brief    
  * @rmtoll   CCR1        LL_GPTIM_GetCompareCH1
  * @param    TIMx TIM instance
  * @retval   
  */
__STATIC_INLINE uint32_t LL_GPTIM_GetCompareCH1(GPTIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->CCR1, 0xffffU) >> 0U);
}

/**
  * @brief    
  * @rmtoll   CCR2        LL_GPTIM_SetCompareCH2
  * @param    TIMx TIM instance
  * @param    CompareValue 
  * @retval   None
  */
__STATIC_INLINE void LL_GPTIM_SetCompareCH2(GPTIM_Type* TIMx, uint32_t CompareValue)
{
    MODIFY_REG(TIMx->CCR2, (0xffffU << 0U), (CompareValue << 0U));
}

/**
  * @brief    
  * @rmtoll   CCR2        LL_GPTIM_GetCompareCH2
  * @param    TIMx TIM instance
  * @retval   
  */
__STATIC_INLINE uint32_t LL_GPTIM_GetCompareCH2(GPTIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->CCR2, 0xffffU) >> 0U);
}

/**
  * @brief    
  * @rmtoll   CCR3        LL_GPTIM_SetCompareCH3
  * @param    TIMx TIM instance
  * @param    CompareValue 
  * @retval   None
  */
__STATIC_INLINE void LL_GPTIM_SetCompareCH3(GPTIM_Type* TIMx, uint32_t CompareValue)
{
    MODIFY_REG(TIMx->CCR3, (0xffffU << 0U), (CompareValue << 0U));
}

/**
  * @brief    
  * @rmtoll   CCR3        LL_GPTIM_GetCompareCH3
  * @param    TIMx TIM instance
  * @retval   
  */
__STATIC_INLINE uint32_t LL_GPTIM_GetCompareCH3(GPTIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->CCR3, 0xffffU) >> 0U);
}

/**
  * @brief    
  * @rmtoll   CCR4        LL_GPTIM_SetCompareCH4
  * @param    TIMx TIM instance
  * @param    CompareValue 
  * @retval   None
  */
__STATIC_INLINE void LL_GPTIM_SetCompareCH4(GPTIM_Type* TIMx, uint32_t CompareValue)
{
    MODIFY_REG(TIMx->CCR4, (0xffffU << 0U), (CompareValue << 0U));
}

/**
  * @brief    
  * @rmtoll   CCR4        LL_GPTIM_GetCompareCH4
  * @param    TIMx TIM instance
  * @retval   
  */
__STATIC_INLINE uint32_t LL_GPTIM_GetCompareCH4(GPTIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->CCR4, 0xffffU) >> 0U);
}

/**
  * @brief    
  * @rmtoll   DCR    DBL    LL_GPTIM_SetConfigDMABurstLenth
  * @param    TIMx TIM instance
  * @param    lenth This parameter can be one of the following values:
  *           @arg @ref LL_GPTIM_DMABURST_LENGTH_1TRANSFER
  *           @arg @ref LL_GPTIM_DMABURST_LENGTH_2TRANSFERS
  *           @arg @ref LL_GPTIM_DMABURST_LENGTH_3TRANSFERS
  *           @arg @ref LL_GPTIM_DMABURST_LENGTH_4TRANSFERS
  *           @arg @ref LL_GPTIM_DMABURST_LENGTH_5TRANSFERS
  *           @arg @ref LL_GPTIM_DMABURST_LENGTH_6TRANSFERS
  *           @arg @ref LL_GPTIM_DMABURST_LENGTH_7TRANSFERS
  *           @arg @ref LL_GPTIM_DMABURST_LENGTH_8TRANSFERS
  *           @arg @ref LL_GPTIM_DMABURST_LENGTH_9TRANSFERS
  *           @arg @ref LL_GPTIM_DMABURST_LENGTH_10TRANSFERS
  *           @arg @ref LL_GPTIM_DMABURST_LENGTH_11TRANSFERS
  *           @arg @ref LL_GPTIM_DMABURST_LENGTH_12TRANSFERS
  *           @arg @ref LL_GPTIM_DMABURST_LENGTH_13TRANSFERS
  *           @arg @ref LL_GPTIM_DMABURST_LENGTH_14TRANSFERS
  *           @arg @ref LL_GPTIM_DMABURST_LENGTH_15TRANSFERS
  *           @arg @ref LL_GPTIM_DMABURST_LENGTH_16TRANSFERS
  *           @arg @ref LL_GPTIM_DMABURST_LENGTH_17TRANSFERS
  *           @arg @ref LL_GPTIM_DMABURST_LENGTH_18TRANSFERS
  * @retval   None
  */
__STATIC_INLINE void LL_GPTIM_SetConfigDMABurstLenth(GPTIM_Type* TIMx, uint32_t lenth)
{
    MODIFY_REG(TIMx->DCR, GPTIM_DCR_DBL_Msk, lenth);
}

/**
  * @brief    
  * @rmtoll   DCR    DBL    LL_GPTIM_GetConfigDMABurstLenth
  * @param    TIMx TIM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_GPTIM_DMABURST_LENGTH_1TRANSFER
  *           @arg @ref LL_GPTIM_DMABURST_LENGTH_2TRANSFERS
  *           @arg @ref LL_GPTIM_DMABURST_LENGTH_3TRANSFERS
  *           @arg @ref LL_GPTIM_DMABURST_LENGTH_4TRANSFERS
  *           @arg @ref LL_GPTIM_DMABURST_LENGTH_5TRANSFERS
  *           @arg @ref LL_GPTIM_DMABURST_LENGTH_6TRANSFERS
  *           @arg @ref LL_GPTIM_DMABURST_LENGTH_7TRANSFERS
  *           @arg @ref LL_GPTIM_DMABURST_LENGTH_8TRANSFERS
  *           @arg @ref LL_GPTIM_DMABURST_LENGTH_9TRANSFERS
  *           @arg @ref LL_GPTIM_DMABURST_LENGTH_10TRANSFERS
  *           @arg @ref LL_GPTIM_DMABURST_LENGTH_11TRANSFERS
  *           @arg @ref LL_GPTIM_DMABURST_LENGTH_12TRANSFERS
  *           @arg @ref LL_GPTIM_DMABURST_LENGTH_13TRANSFERS
  *           @arg @ref LL_GPTIM_DMABURST_LENGTH_14TRANSFERS
  *           @arg @ref LL_GPTIM_DMABURST_LENGTH_15TRANSFERS
  *           @arg @ref LL_GPTIM_DMABURST_LENGTH_16TRANSFERS
  *           @arg @ref LL_GPTIM_DMABURST_LENGTH_17TRANSFERS
  *           @arg @ref LL_GPTIM_DMABURST_LENGTH_18TRANSFERS
  */
__STATIC_INLINE uint32_t LL_GPTIM_GetConfigDMABurstLenth(GPTIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->DCR, GPTIM_DCR_DBL_Msk));
}

/**
  * @brief    
  * @rmtoll   DCR    DBA    LL_GPTIM_SetConfigDMABurstAddress
  * @param    TIMx TIM instance
  * @param    address This parameter can be one of the following values:
  *           @arg @ref LL_GPTIM_DMABURST_BASEADDR_CR1
  *           @arg @ref LL_GPTIM_DMABURST_BASEADDR_CR2
  *           @arg @ref LL_GPTIM_DMABURST_BASEADDR_SMCR
  *           @arg @ref LL_GPTIM_DMABURST_BASEADDR_DIER
  *           @arg @ref LL_GPTIM_DMABURST_BASEADDR_SR
  *           @arg @ref LL_GPTIM_DMABURST_BASEADDR_EGR
  *           @arg @ref LL_GPTIM_DMABURST_BASEADDR_CCMR1
  *           @arg @ref LL_GPTIM_DMABURST_BASEADDR_CCMR2
  *           @arg @ref LL_GPTIM_DMABURST_BASEADDR_CCER
  *           @arg @ref LL_GPTIM_DMABURST_BASEADDR_CNT
  *           @arg @ref LL_GPTIM_DMABURST_BASEADDR_PSC
  *           @arg @ref LL_GPTIM_DMABURST_BASEADDR_ARR
  *           @arg @ref LL_GPTIM_DMABURST_BASEADDR_RCR
  *           @arg @ref LL_GPTIM_DMABURST_BASEADDR_CCR1
  *           @arg @ref LL_GPTIM_DMABURST_BASEADDR_CCR2
  *           @arg @ref LL_GPTIM_DMABURST_BASEADDR_CCR3
  *           @arg @ref LL_GPTIM_DMABURST_BASEADDR_CCR4
  *           @arg @ref LL_GPTIM_DMABURST_BASEADDR_BDTR
  * @retval   None
  */
__STATIC_INLINE void LL_GPTIM_SetConfigDMABurstAddress(GPTIM_Type* TIMx, uint32_t address)
{
    MODIFY_REG(TIMx->DCR, GPTIM_DCR_DBA_Msk, address);
}

