xdu-aero-association/FM33LC0XX_Example_0.04/COMP 比较器 休眠中断/Drivers/FM33LC0xx_LL_Driver/Inc/fm33lc0xx_ll_gptim.h
/**
  * @brief    
  * @rmtoll   DCR    DBA    LL_GPTIM_GetConfigDMABurstAddress
  * @param    TIMx TIM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_GPTIM_DMABURST_BASEADDR_CR1
  *           @arg @ref LL_GPTIM_DMABURST_BASEADDR_CR2
  *           @arg @ref LL_GPTIM_DMABURST_BASEADDR_SMCR
  *           @arg @ref LL_GPTIM_DMABURST_BASEADDR_DIER
  *           @arg @ref LL_GPTIM_DMABURST_BASEADDR_SR
  *           @arg @ref LL_GPTIM_DMABURST_BASEADDR_EGR
  *           @arg @ref LL_GPTIM_DMABURST_BASEADDR_CCMR1
  *           @arg @ref LL_GPTIM_DMABURST_BASEADDR_CCMR2
  *           @arg @ref LL_GPTIM_DMABURST_BASEADDR_CCER
  *           @arg @ref LL_GPTIM_DMABURST_BASEADDR_CNT
  *           @arg @ref LL_GPTIM_DMABURST_BASEADDR_PSC
  *           @arg @ref LL_GPTIM_DMABURST_BASEADDR_ARR
  *           @arg @ref LL_GPTIM_DMABURST_BASEADDR_RCR
  *           @arg @ref LL_GPTIM_DMABURST_BASEADDR_CCR1
  *           @arg @ref LL_GPTIM_DMABURST_BASEADDR_CCR2
  *           @arg @ref LL_GPTIM_DMABURST_BASEADDR_CCR3
  *           @arg @ref LL_GPTIM_DMABURST_BASEADDR_CCR4
  *           @arg @ref LL_GPTIM_DMABURST_BASEADDR_BDTR
  */
__STATIC_INLINE uint32_t LL_GPTIM_GetConfigDMABurstAddress(GPTIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->DCR, GPTIM_DCR_DBA_Msk));
}

/**
  * @brief    
  * @rmtoll   DMAR        LL_GPTIM_SetConfigDMAR
  * @param    TIMx TIM instance
  * @param    Addr 
  * @retval   None
  */
__STATIC_INLINE void LL_GPTIM_SetConfigDMAR(GPTIM_Type* TIMx, uint32_t Addr)
{
    MODIFY_REG(TIMx->DMAR, (0xffffU << 0U), (Addr << 0U));
}

/**
  * @brief    
  * @rmtoll   DMAR        LL_GPTIM_GetConfigDMAR
  * @param    TIMx TIM instance
  * @retval   
  */
__STATIC_INLINE uint32_t LL_GPTIM_GetConfigDMAR(GPTIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->DMAR, 0xffffU) >> 0U);
}

/**
  * @brief    
  * @rmtoll   ITRSEL    ITR0SEL    LL_GPTIM_SetGPTIM0ITR0Input
  * @param    TIMx TIM instance
  * @param    Input This parameter can be one of the following values:
  *           @arg @ref LL_GPTIM_ITR0SEL_ATIM_TRGO
  *           @arg @ref LL_GPTIM_ITR0SEL_UART0_RX
  *           @arg @ref LL_GPTIM_ITR0SEL_UART1_RX
  *           @arg @ref LL_GPTIM_ITR0SEL_UART4_RX
  * @retval   None
  */
__STATIC_INLINE void LL_GPTIM_SetGPTIM0ITR0Input(GPTIM_Type* TIMx, uint32_t Input)
{
    MODIFY_REG(TIMx->ITRSEL, GPTIM_ITRSEL_ITR0SEL_Msk, Input);
}

/**
  * @brief    
  * @rmtoll   ITRSEL    ITR0SEL    LL_GPTIM_GetGPTIM0ITR0Input
  * @param    TIMx TIM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_GPTIM_ITR0SEL_ATIM_TRGO
  *           @arg @ref LL_GPTIM_ITR0SEL_UART0_RX
  *           @arg @ref LL_GPTIM_ITR0SEL_UART1_RX
  *           @arg @ref LL_GPTIM_ITR0SEL_UART4_RX
  */
__STATIC_INLINE uint32_t LL_GPTIM_GetGPTIM0ITR0Input(GPTIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->ITRSEL, GPTIM_ITRSEL_ITR0SEL_Msk));
}

/**
  * @brief    
  * @rmtoll   ITRSEL    ITR1SEL    LL_GPTIM_SetGPTIM0ITR1Input
  * @param    TIMx TIM instance
  * @param    Input This parameter can be one of the following values:
  *           @arg @ref LL_GPTIM_ITR1SEL_GPTIM1_TRGO
  *           @arg @ref LL_GPTIM_ITR1SEL_XTHF
  *           @arg @ref LL_GPTIM_ITR1SEL_RCHF
  *           @arg @ref LL_GPTIM_ITR1SEL_LPUART0_RX
  * @retval   None
  */
__STATIC_INLINE void LL_GPTIM_SetGPTIM0ITR1Input(GPTIM_Type* TIMx, uint32_t Input)
{
    MODIFY_REG(TIMx->ITRSEL, GPTIM_ITRSEL_ITR1SEL_Msk, Input);
}

/**
  * @brief    
  * @rmtoll   ITRSEL    ITR1SEL    LL_GPTIM_GetGPTIM0ITR1Input
  * @param    TIMx TIM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_GPTIM_ITR1SEL_GPTIM1_TRGO
  *           @arg @ref LL_GPTIM_ITR1SEL_XTHF
  *           @arg @ref LL_GPTIM_ITR1SEL_RCHF
  *           @arg @ref LL_GPTIM_ITR1SEL_LPUART0_RX
  */
__STATIC_INLINE uint32_t LL_GPTIM_GetGPTIM0ITR1Input(GPTIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->ITRSEL, GPTIM_ITRSEL_ITR1SEL_Msk));
}

/**
  * @brief    
  * @rmtoll   ITRSEL    ITR2SEL    LL_GPTIM_SetGPTIM0ITR2Input
  * @param    TIMx TIM instance
  * @param    Input This parameter can be one of the following values:
  *           @arg @ref LL_GPTIM_ITR2SEL_BSTIM_TRGO
  *           @arg @ref LL_GPTIM_ITR2SEL_LPUART1_TX
  *           @arg @ref LL_GPTIM_ITR2SEL_RCLP
  *           @arg @ref LL_GPTIM_ITR2SEL_XTLF
  * @retval   None
  */
__STATIC_INLINE void LL_GPTIM_SetGPTIM0ITR2Input(GPTIM_Type* TIMx, uint32_t Input)
{
    MODIFY_REG(TIMx->ITRSEL, GPTIM_ITRSEL_ITR2SEL_Msk, Input);
}

/**
  * @brief    
  * @rmtoll   ITRSEL    ITR2SEL    LL_GPTIM_GetGPTIM0ITR2Input
  * @param    TIMx TIM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_GPTIM_ITR2SEL_BSTIM_TRGO
  *           @arg @ref LL_GPTIM_ITR2SEL_LPUART1_TX
  *           @arg @ref LL_GPTIM_ITR2SEL_RCLP
  *           @arg @ref LL_GPTIM_ITR2SEL_XTLF
  */
__STATIC_INLINE uint32_t LL_GPTIM_GetGPTIM0ITR2Input(GPTIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->ITRSEL, GPTIM_ITRSEL_ITR2SEL_Msk));
}

/**
  * @brief    
  * @rmtoll   ITRSEL    ITR3SEL    LL_GPTIM_SetGPTIM0ITR3Input
  * @param    TIMx TIM instance
  * @param    Input This parameter can be one of the following values:
  *           @arg @ref LL_GPTIM_ITR3SEL_COMP1_TRGO
  *           @arg @ref LL_GPTIM_ITR3SEL_RC4M
  *           @arg @ref LL_GPTIM_ITR3SEL_COMP2_TRGO
  *           @arg @ref LL_GPTIM_ITR3SEL_LPT32_TRGO
  * @retval   None
  */
__STATIC_INLINE void LL_GPTIM_SetGPTIM0ITR3Input(GPTIM_Type* TIMx, uint32_t Input)
{
    MODIFY_REG(TIMx->ITRSEL, GPTIM_ITRSEL_ITR3SEL_Msk, Input);
}

/**
  * @brief    
  * @rmtoll   ITRSEL    ITR3SEL    LL_GPTIM_GetGPTIM0ITR3Input
  * @param    TIMx TIM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_GPTIM_ITR3SEL_COMP1_TRGO
  *           @arg @ref LL_GPTIM_ITR3SEL_RC4M
  *           @arg @ref LL_GPTIM_ITR3SEL_COMP2_TRGO
  *           @arg @ref LL_GPTIM_ITR3SEL_LPT32_TRGO
  */
__STATIC_INLINE uint32_t LL_GPTIM_GetGPTIM0ITR3Input(GPTIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->ITRSEL, GPTIM_ITRSEL_ITR3SEL_Msk));
}

/**
  * @brief    
  * @rmtoll   ITRSEL    ITR0SEL    LL_GPTIM_SetGPTIM1ITR0Input
  * @param    TIMx TIM instance
  * @param    Input This parameter can be one of the following values:
  *           @arg @ref LL_GPTIM_ITR0SEL_ATIM_TRGO
  *           @arg @ref LL_GPTIM_ITR0SEL_UART0_RX
  *           @arg @ref LL_GPTIM_ITR0SEL_UART1_RX
  *           @arg @ref LL_GPTIM_ITR0SEL_UART4_RX
  * @retval   None
  */
__STATIC_INLINE void LL_GPTIM_SetGPTIM1ITR0Input(GPTIM_Type* TIMx, uint32_t Input)
{
    MODIFY_REG(TIMx->ITRSEL, GPTIM_ITRSEL_ITR0SEL_Msk, Input);
}

/**
  * @brief    
  * @rmtoll   ITRSEL    ITR0SEL    LL_GPTIM_GetGPTIM1ITR0Input
  * @param    TIMx TIM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_GPTIM_ITR0SEL_ATIM_TRGO
  *           @arg @ref LL_GPTIM_ITR0SEL_UART0_RX
  *           @arg @ref LL_GPTIM_ITR0SEL_UART1_RX
  *           @arg @ref LL_GPTIM_ITR0SEL_UART4_RX
  */
__STATIC_INLINE uint32_t LL_GPTIM_GetGPTIM1ITR0Input(GPTIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->ITRSEL, GPTIM_ITRSEL_ITR0SEL_Msk));
}

/**
  * @brief    
  * @rmtoll   ITRSEL    ITR1SEL    LL_GPTIM_SetGPTIM1ITR1Input
  * @param    TIMx TIM instance
  * @param    Input This parameter can be one of the following values:
  *           @arg @ref LL_GPTIM_ITR1SEL_GPTIM0_TRGO
  *           @arg @ref LL_GPTIM_ITR1SEL_XTHF
  *           @arg @ref LL_GPTIM_ITR1SEL_RCHF
  *           @arg @ref LL_GPTIM_ITR1SEL_ADC_EOC
  * @retval   None
  */
__STATIC_INLINE void LL_GPTIM_SetGPTIM1ITR1Input(GPTIM_Type* TIMx, uint32_t Input)
{
    MODIFY_REG(TIMx->ITRSEL, GPTIM_ITRSEL_ITR1SEL_Msk, Input);
}

/**
  * @brief    
  * @rmtoll   ITRSEL    ITR1SEL    LL_GPTIM_GetGPTIM1ITR1Input
  * @param    TIMx TIM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_GPTIM_ITR1SEL_GPTIM0_TRGO
  *           @arg @ref LL_GPTIM_ITR1SEL_XTHF
  *           @arg @ref LL_GPTIM_ITR1SEL_RCHF
  *           @arg @ref LL_GPTIM_ITR1SEL_ADC_EOC
  */
__STATIC_INLINE uint32_t LL_GPTIM_GetGPTIM1ITR1Input(GPTIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->ITRSEL, GPTIM_ITRSEL_ITR1SEL_Msk));
}

/**
  * @brief    
  * @rmtoll   ITRSEL    ITR2SEL    LL_GPTIM_SetGPTIM1ITR2Input
  * @param    TIMx TIM instance
  * @param    Input This parameter can be one of the following values:
  *           @arg @ref LL_GPTIM_ITR2SEL_BSTIM_TRGO
  *           @arg @ref LL_GPTIM_ITR2SEL_LSCLK
  *           @arg @ref LL_GPTIM_ITR2SEL_RCLP
  *           @arg @ref LL_GPTIM_ITR2SEL_XTLF
  * @retval   None
  */
__STATIC_INLINE void LL_GPTIM_SetGPTIM1ITR2Input(GPTIM_Type* TIMx, uint32_t Input)
{
    MODIFY_REG(TIMx->ITRSEL, GPTIM_ITRSEL_ITR2SEL_Msk, Input);
}

/**
  * @brief    
  * @rmtoll   ITRSEL    ITR2SEL    LL_GPTIM_GetGPTIM1ITR2Input
  * @param    TIMx TIM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_GPTIM_ITR2SEL_BSTIM_TRGO
  *           @arg @ref LL_GPTIM_ITR2SEL_LSCLK
  *           @arg @ref LL_GPTIM_ITR2SEL_RCLP
  *           @arg @ref LL_GPTIM_ITR2SEL_XTLF
  */
__STATIC_INLINE uint32_t LL_GPTIM_GetGPTIM1ITR2Input(GPTIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->ITRSEL, GPTIM_ITRSEL_ITR2SEL_Msk));
}

/**
  * @brief    
  * @rmtoll   ITRSEL    ITR3SEL    LL_GPTIM_SetGPTIM1ITR3Input
  * @param    TIMx TIM instance
  * @param    Input This parameter can be one of the following values:
  *           @arg @ref LL_GPTIM_ITR3SEL_COMP1_TRGO
  *           @arg @ref LL_GPTIM_ITR3SEL_RC4M
  *           @arg @ref LL_GPTIM_ITR3SEL_COMP2_TRGO
  *           @arg @ref LL_GPTIM_ITR3SEL_LPT32_TRGO
  * @retval   None
  */
__STATIC_INLINE void LL_GPTIM_SetGPTIM1ITR3Input(GPTIM_Type* TIMx, uint32_t Input)
{
    MODIFY_REG(TIMx->ITRSEL, GPTIM_ITRSEL_ITR3SEL_Msk, Input);
}

/**
  * @brief    
  * @rmtoll   ITRSEL    ITR3SEL    LL_GPTIM_GetGPTIM1ITR3Input
  * @param    TIMx TIM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_GPTIM_ITR3SEL_COMP1_TRGO
  *           @arg @ref LL_GPTIM_ITR3SEL_RC4M
  *           @arg @ref LL_GPTIM_ITR3SEL_COMP2_TRGO
  *           @arg @ref LL_GPTIM_ITR3SEL_LPT32_TRGO
  */
__STATIC_INLINE uint32_t LL_GPTIM_GetGPTIM1ITR3Input(GPTIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->ITRSEL, GPTIM_ITRSEL_ITR3SEL_Msk));
}

/**
  * @brief    
  * @rmtoll   CCMR    OCCE    LL_GPTIM_Enable_Clear
  * @param    TIMx TIM instance
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_GPTIM_CHANNEL_1
  *           @arg @ref LL_GPTIM_CHANNEL_2
  *           @arg @ref LL_GPTIM_CHANNEL_3
  *           @arg @ref LL_GPTIM_CHANNEL_4
  * @retval   None
  */
__STATIC_INLINE void LL_GPTIM_Enable_Clear(GPTIM_Type* TIMx, uint32_t Channel)
{
    if(Channel<LL_GPTIM_CHANNEL_3)
    {
        SET_BIT(TIMx->CCMR1,(GPTIM_CCMR_OCCE_Msk << (Channel*8)));
    }
    else
    {
        SET_BIT(TIMx->CCMR2,(GPTIM_CCMR_OCCE_Msk << ((Channel-2)*8)));
    }        
}

/**
  * @brief    
  * @rmtoll   CCMR    OCCE    LL_GPTIM_IsEnabled_Clear
  * @param    TIMx TIM instance
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_GPTIM_CHANNEL_1
  *           @arg @ref LL_GPTIM_CHANNEL_2
  *           @arg @ref LL_GPTIM_CHANNEL_3
  *           @arg @ref LL_GPTIM_CHANNEL_4
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_GPTIM_IsEnabled_Clear(GPTIM_Type* TIMx, uint32_t Channel)
{
    if(Channel<LL_GPTIM_CHANNEL_3)
    {
        return (uint32_t)(READ_BIT(TIMx->CCMR1,(GPTIM_CCMR_OCCE_Msk << (Channel*8))) == (GPTIM_CCMR_OCCE_Msk << (Channel*8)));
    }
    else
    {
        return (uint32_t)(READ_BIT(TIMx->CCMR2,(GPTIM_CCMR_OCCE_Msk << ((Channel-2)*8))) == (GPTIM_CCMR_OCCE_Msk << ((Channel-2)*8)));
    }   
}

/**
  * @brief    
  * @rmtoll   CCMR    OCCE    LL_GPTIM_Disable_Clear
  * @param    TIMx TIM instance
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_GPTIM_CHANNEL_1
  *           @arg @ref LL_GPTIM_CHANNEL_2
  *           @arg @ref LL_GPTIM_CHANNEL_3
  *           @arg @ref LL_GPTIM_CHANNEL_4
  * @retval   None
  */
__STATIC_INLINE void LL_GPTIM_Disable_Clear(GPTIM_Type* TIMx, uint32_t Channel)
{
    if(Channel<LL_GPTIM_CHANNEL_3)
    {
        CLEAR_BIT(TIMx->CCMR1,(GPTIM_CCMR_OCCE_Msk << (Channel*8)));
    }
    else
    {
        CLEAR_BIT(TIMx->CCMR2,(GPTIM_CCMR_OCCE_Msk << ((Channel-2)*8)));
    }  
}

/**
  * @brief    
  * @rmtoll   CCMR    OCM    LL_GPTIM_SetOCMode
  * @param    TIMx TIM instance
  * @param    Mode This parameter can be one of the following values:
  *           @arg @ref LL_GPTIM_OC_MODE_FROZEN
  *           @arg @ref LL_GPTIM_OC_MODE_ACTIVE
  *           @arg @ref LL_GPTIM_OC_MODE_INACTIVE
  *           @arg @ref LL_GPTIM_OC_MODE_TOGGLE
  *           @arg @ref LL_GPTIM_OC_MODE_FORCED_INACTIVE
  *           @arg @ref LL_GPTIM_OC_MODE_FORCED_ACTIVE
  *           @arg @ref LL_GPTIM_OC_MODE_PWM1
  *           @arg @ref LL_GPTIM_OC_MODE_PWM2
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_GPTIM_CHANNEL_1
  *           @arg @ref LL_GPTIM_CHANNEL_2
  *           @arg @ref LL_GPTIM_CHANNEL_3
  *           @arg @ref LL_GPTIM_CHANNEL_4
  * @retval   None
  */
__STATIC_INLINE void LL_GPTIM_SetOCMode(GPTIM_Type* TIMx, uint32_t Mode, uint32_t Channel)
{
    if(Channel<LL_GPTIM_CHANNEL_3)
    {
        MODIFY_REG(TIMx->CCMR1,(GPTIM_CCMR_OCM_Msk << (Channel*8)),(Mode << (Channel*8)));
    }
    else
    {
        MODIFY_REG(TIMx->CCMR2,(GPTIM_CCMR_OCM_Msk << ((Channel-2)*8)),(Mode << ((Channel-2)*8)));
    }  
}

/**
  * @brief    
  * @rmtoll   CCMR    OCM    LL_GPTIM_GetOCMode
  * @param    TIMx TIM instance
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_GPTIM_CHANNEL_1
  *           @arg @ref LL_GPTIM_CHANNEL_2
  *           @arg @ref LL_GPTIM_CHANNEL_3
  *           @arg @ref LL_GPTIM_CHANNEL_4
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_GPTIM_OC_MODE_FROZEN
  *           @arg @ref LL_GPTIM_OC_MODE_ACTIVE
  *           @arg @ref LL_GPTIM_OC_MODE_INACTIVE
  *           @arg @ref LL_GPTIM_OC_MODE_TOGGLE
  *           @arg @ref LL_GPTIM_OC_MODE_FORCED_INACTIVE
  *           @arg @ref LL_GPTIM_OC_MODE_FORCED_ACTIVE
  *           @arg @ref LL_GPTIM_OC_MODE_PWM1
  *           @arg @ref LL_GPTIM_OC_MODE_PWM2
  */
__STATIC_INLINE uint32_t LL_GPTIM_GetOCMode(GPTIM_Type* TIMx, uint32_t Channel)
{
    if(Channel<LL_GPTIM_CHANNEL_3)
    {
        return (uint32_t)(READ_BIT(TIMx->CCMR1, (GPTIM_CCMR_OCM_Msk << (Channel*8))));
    }
    else
    {
        return (uint32_t)(READ_BIT(TIMx->CCMR2, (GPTIM_CCMR_OCM_Msk << ((Channel-2)*8))));
    }  
}

/**
  * @brief    
  * @rmtoll   CCMR    OCPE    LL_GPTIM_Enable_Preload
  * @param    TIMx TIM instance
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_GPTIM_CHANNEL_1
  *           @arg @ref LL_GPTIM_CHANNEL_2
  *           @arg @ref LL_GPTIM_CHANNEL_3
  *           @arg @ref LL_GPTIM_CHANNEL_4
  * @retval   None
  */
__STATIC_INLINE void LL_GPTIM_Enable_Preload(GPTIM_Type* TIMx, uint32_t Channel)
{
    if(Channel<LL_GPTIM_CHANNEL_3)
    {
        SET_BIT(TIMx->CCMR1,(GPTIM_CCMR_OCPE_Msk << (Channel*8)));
    }
    else
    {
        SET_BIT(TIMx->CCMR2,(GPTIM_CCMR_OCPE_Msk << ((Channel-2)*8)));
    }  
}

/**
  * @brief    
  * @rmtoll   CCMR    OCPE    LL_GPTIM_IsEnabled_Preload
  * @param    TIMx TIM instance
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_GPTIM_CHANNEL_1
  *           @arg @ref LL_GPTIM_CHANNEL_2
  *           @arg @ref LL_GPTIM_CHANNEL_3
  *           @arg @ref LL_GPTIM_CHANNEL_4
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_GPTIM_IsEnabled_Preload(GPTIM_Type* TIMx, uint32_t Channel)
{
    if(Channel<LL_GPTIM_CHANNEL_3)
    {
        return (uint32_t)(READ_BIT(TIMx->CCMR1,(GPTIM_CCMR_OCPE_Msk << (Channel*8))) == (GPTIM_CCMR_OCPE_Msk << (Channel*8)));
    }
    else
    {
        return (uint32_t)(READ_BIT(TIMx->CCMR2,(GPTIM_CCMR_OCPE_Msk << ((Channel-2)*8))) == (GPTIM_CCMR_OCPE_Msk << ((Channel-2)*8)));
    }  
}

/**
  * @brief    
  * @rmtoll   CCMR    OCPE    LL_GPTIM_Disable_Preload
  * @param    TIMx TIM instance
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_GPTIM_CHANNEL_1
  *           @arg @ref LL_GPTIM_CHANNEL_2
  *           @arg @ref LL_GPTIM_CHANNEL_3
  *           @arg @ref LL_GPTIM_CHANNEL_4
  * @retval   None
  */
__STATIC_INLINE void LL_GPTIM_Disable_Preload(GPTIM_Type* TIMx, uint32_t Channel)
{
    if(Channel<LL_GPTIM_CHANNEL_3)
    {
        CLEAR_BIT(TIMx->CCMR1,(GPTIM_CCMR_OCPE_Msk << (Channel*8)));
    }
    else
    {
        CLEAR_BIT(TIMx->CCMR2,(GPTIM_CCMR_OCPE_Msk << ((Channel-2)*8)));
    }   
}

/**
  * @brief    
  * @rmtoll   CCMR    OCFE    LL_GPTIM_Enable_FastCompare
  * @param    TIMx TIM instance
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_GPTIM_CHANNEL_1
  *           @arg @ref LL_GPTIM_CHANNEL_2
  *           @arg @ref LL_GPTIM_CHANNEL_3
  *           @arg @ref LL_GPTIM_CHANNEL_4
  * @retval   None
  */
__STATIC_INLINE void LL_GPTIM_Enable_FastCompare(GPTIM_Type* TIMx, uint32_t Channel)
{
    if(Channel<LL_GPTIM_CHANNEL_3)
    {
        SET_BIT(TIMx->CCMR1,(GPTIM_CCMR_OCFE_Msk << (Channel*8)));
    }
    else
    {
        SET_BIT(TIMx->CCMR2,(GPTIM_CCMR_OCFE_Msk << ((Channel-2)*8)));
    }   
}

/**
  * @brief    
  * @rmtoll   CCMR    OCFE    LL_GPTIM_IsEnabled_FastCompare
  * @param    TIMx TIM instance
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_GPTIM_CHANNEL_1
  *           @arg @ref LL_GPTIM_CHANNEL_2
  *           @arg @ref LL_GPTIM_CHANNEL_3
  *           @arg @ref LL_GPTIM_CHANNEL_4
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_GPTIM_IsEnabled_FastCompare(GPTIM_Type* TIMx, uint32_t Channel)
{
    if(Channel<LL_GPTIM_CHANNEL_3)
    {
        return (uint32_t)(READ_BIT(TIMx->CCMR1,(GPTIM_CCMR_OCFE_Msk << (Channel*8))) == (GPTIM_CCMR_OCFE_Msk << (Channel*8)));
    }
    else
    {
        return (uint32_t)(READ_BIT(TIMx->CCMR2,(GPTIM_CCMR_OCFE_Msk << ((Channel-2)*8))) == (GPTIM_CCMR_OCFE_Msk << ((Channel-2)*8)));
    }  
}

/**
  * @brief    
  * @rmtoll   CCMR    OCFE    LL_GPTIM_Disable_FastCompare
  * @param    TIMx TIM instance
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_GPTIM_CHANNEL_1
  *           @arg @ref LL_GPTIM_CHANNEL_2
  *           @arg @ref LL_GPTIM_CHANNEL_3
  *           @arg @ref LL_GPTIM_CHANNEL_4
  * @retval   None
  */
__STATIC_INLINE void LL_GPTIM_Disable_FastCompare(GPTIM_Type* TIMx, uint32_t Channel)
{
    if(Channel<LL_GPTIM_CHANNEL_3)
    {
        CLEAR_BIT(TIMx->CCMR1,(GPTIM_CCMR_OCFE_Msk << (Channel*8)));
    }
    else
    {
        CLEAR_BIT(TIMx->CCMR2,(GPTIM_CCMR_OCFE_Msk << ((Channel-2)*8)));
    }   
}

/**
  * @brief    
  * @rmtoll   CCMR    ICF    LL_GPTIM_SetICModeFilter
  * @param    TIMx TIM instance
  * @param    filter This parameter can be one of the following values:
  *           @arg @ref LL_GPTIM_IC_FILTER_FDIV1
  *           @arg @ref LL_GPTIM_IC_FILTER_FDIV1_N2
  *           @arg @ref LL_GPTIM_IC_FILTER_FDIV1_N4
  *           @arg @ref LL_GPTIM_IC_FILTER_FDIV1_N8
  *           @arg @ref LL_GPTIM_IC_FILTER_FDIV2_N6
  *           @arg @ref LL_GPTIM_IC_FILTER_FDIV2_N8
  *           @arg @ref LL_GPTIM_IC_FILTER_FDIV4_N6
  *           @arg @ref LL_GPTIM_IC_FILTER_FDIV4_N8
  *           @arg @ref LL_GPTIM_IC_FILTER_FDIV8_N6
  *           @arg @ref LL_GPTIM_IC_FILTER_FDIV8_N8
  *           @arg @ref LL_GPTIM_IC_FILTER_FDIV16_N5
  *           @arg @ref LL_GPTIM_IC_FILTER_FDIV16_N6
  *           @arg @ref LL_GPTIM_IC_FILTER_FDIV16_N8
  *           @arg @ref LL_GPTIM_IC_FILTER_FDIV32_N5
  *           @arg @ref LL_GPTIM_IC_FILTER_FDIV32_N6
  *           @arg @ref LL_GPTIM_IC_FILTER_FDIV32_N8
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_GPTIM_CHANNEL_1
  *           @arg @ref LL_GPTIM_CHANNEL_2
  *           @arg @ref LL_GPTIM_CHANNEL_3
  *           @arg @ref LL_GPTIM_CHANNEL_4
  * @retval   None
  */
__STATIC_INLINE void LL_GPTIM_SetICModeFilter(GPTIM_Type* TIMx, uint32_t filter, uint32_t Channel)
{
    if(Channel<LL_GPTIM_CHANNEL_3)
    {
        MODIFY_REG(TIMx->CCMR1,(GPTIM_CCMR_ICF_Msk << (Channel*8)),(filter << (Channel*8)));
    }
    else
    {
        MODIFY_REG(TIMx->CCMR2,(GPTIM_CCMR_ICF_Msk << ((Channel-2)*8)),(filter << ((Channel-2)*8)));
    }   
}

/**
  * @brief    
  * @rmtoll   CCMR    ICF    LL_GPTIM_GetICModeFilter
  * @param    TIMx TIM instance
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_GPTIM_CHANNEL_1
  *           @arg @ref LL_GPTIM_CHANNEL_2
  *           @arg @ref LL_GPTIM_CHANNEL_3
  *           @arg @ref LL_GPTIM_CHANNEL_4
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_GPTIM_IC_FILTER_FDIV1
  *           @arg @ref LL_GPTIM_IC_FILTER_FDIV1_N2
  *           @arg @ref LL_GPTIM_IC_FILTER_FDIV1_N4
  *           @arg @ref LL_GPTIM_IC_FILTER_FDIV1_N8
  *           @arg @ref LL_GPTIM_IC_FILTER_FDIV2_N6
  *           @arg @ref LL_GPTIM_IC_FILTER_FDIV2_N8
  *           @arg @ref LL_GPTIM_IC_FILTER_FDIV4_N6
  *           @arg @ref LL_GPTIM_IC_FILTER_FDIV4_N8
  *           @arg @ref LL_GPTIM_IC_FILTER_FDIV8_N6
  *           @arg @ref LL_GPTIM_IC_FILTER_FDIV8_N8
  *           @arg @ref LL_GPTIM_IC_FILTER_FDIV16_N5
  *           @arg @ref LL_GPTIM_IC_FILTER_FDIV16_N6
  *           @arg @ref LL_GPTIM_IC_FILTER_FDIV16_N8
  *           @arg @ref LL_GPTIM_IC_FILTER_FDIV32_N5
  *           @arg @ref LL_GPTIM_IC_FILTER_FDIV32_N6
  *           @arg @ref LL_GPTIM_IC_FILTER_FDIV32_N8
  */
__STATIC_INLINE uint32_t LL_GPTIM_GetICModeFilter(GPTIM_Type* TIMx, uint32_t Channel)
{
    if(Channel<LL_GPTIM_CHANNEL_3)
    {
        return (uint32_t)(READ_BIT(TIMx->CCMR1, (GPTIM_CCMR_ICF_Msk << (Channel*8))));
    }
    else
    {
        return (uint32_t)(READ_BIT(TIMx->CCMR2, (GPTIM_CCMR_ICF_Msk << ((Channel-2)*8))));
    }   
}

/**
  * @brief    
  * @rmtoll   CCMR    ICPSC    LL_GPTIM_SetICModePrescaler
  * @param    TIMx TIM instance
  * @param    Psc This parameter can be one of the following values:
  *           @arg @ref LL_GPTIM_IC_PRESCALER_DIV_1
  *           @arg @ref LL_GPTIM_IC_PRESCALER_DIV_2
  *           @arg @ref LL_GPTIM_IC_PRESCALER_DIV_4
  *           @arg @ref LL_GPTIM_IC_PRESCALER_DIV_8
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_GPTIM_CHANNEL_1
  *           @arg @ref LL_GPTIM_CHANNEL_2
  *           @arg @ref LL_GPTIM_CHANNEL_3
  *           @arg @ref LL_GPTIM_CHANNEL_4
  * @retval   None
  */
__STATIC_INLINE void LL_GPTIM_SetICModePrescaler(GPTIM_Type* TIMx, uint32_t Psc, uint32_t Channel)
{
    if(Channel<LL_GPTIM_CHANNEL_3)
    {
        MODIFY_REG(TIMx->CCMR1,(GPTIM_CCMR_ICPSC_Msk << (Channel*8)),(Psc << (Channel*8)));
    }
    else
    {
        MODIFY_REG(TIMx->CCMR2,(GPTIM_CCMR_ICPSC_Msk << ((Channel-2)*8)),(Psc << ((Channel-2)*8)));
    }  
}

