xdu-aero-association/FM33LC0XX_Example_0.04/COMP 比较器 休眠中断/Drivers/FM33LC0xx_LL_Driver/Inc/fm33lc0xx_ll_gptim.h
/**
  * @brief    
  * @rmtoll   CCMR    ICPSC    LL_GPTIM_GetICModePrescaler
  * @param    TIMx TIM instance
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_GPTIM_CHANNEL_1
  *           @arg @ref LL_GPTIM_CHANNEL_2
  *           @arg @ref LL_GPTIM_CHANNEL_3
  *           @arg @ref LL_GPTIM_CHANNEL_4
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_GPTIM_IC_PRESCALER_DIV_1
  *           @arg @ref LL_GPTIM_IC_PRESCALER_DIV_2
  *           @arg @ref LL_GPTIM_IC_PRESCALER_DIV_4
  *           @arg @ref LL_GPTIM_IC_PRESCALER_DIV_8
  */
__STATIC_INLINE uint32_t LL_GPTIM_GetICModePrescaler(GPTIM_Type* TIMx, uint32_t Channel)
{
    if(Channel<LL_GPTIM_CHANNEL_3)
    {
        return (uint32_t)(READ_BIT(TIMx->CCMR1, (GPTIM_CCMR_ICPSC_Msk << (Channel*8))));
    }
    else
    {
        return (uint32_t)(READ_BIT(TIMx->CCMR2, (GPTIM_CCMR_ICPSC_Msk << ((Channel-2)*8))));
    }  
}

/**
  * @brief    
  * @rmtoll   CCMR    CCS    LL_GPTIM_SetChannelMode
  * @param    TIMx TIM instance
  * @param    Mode This parameter can be one of the following values:
  *           @arg @ref LL_GPTIM_CC_MODE_OUTPUT
  *           @arg @ref LL_GPTIM_CC1_MODE_INPUT_TI1
  *           @arg @ref LL_GPTIM_CC1_MODE_INPUT_TI2
  *           @arg @ref LL_GPTIM_CC2_MODE_INPUT_TI2
  *           @arg @ref LL_GPTIM_CC2_MODE_INPUT_TI1
  *           @arg @ref LL_GPTIM_CC3_MODE_INPUT_TI3
  *           @arg @ref LL_GPTIM_CC3_MODE_INPUT_TI4
  *           @arg @ref LL_GPTIM_CC4_MODE_INPUT_TI4
  *           @arg @ref LL_GPTIM_CC4_MODE_INPUT_TI3
  *           @arg @ref LL_GPTIM_CC_MODE_INPUT_TRC
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_GPTIM_CHANNEL_1
  *           @arg @ref LL_GPTIM_CHANNEL_2
  *           @arg @ref LL_GPTIM_CHANNEL_3
  *           @arg @ref LL_GPTIM_CHANNEL_4
  * @retval   None
  */
__STATIC_INLINE void LL_GPTIM_SetChannelMode(GPTIM_Type* TIMx, uint32_t Mode, uint32_t Channel)
{
    if(Channel<LL_GPTIM_CHANNEL_3)
    {
        MODIFY_REG(TIMx->CCMR1,(GPTIM_CCMR_CCS_Msk << (Channel*8)),(Mode << (Channel*8)));
    }
    else
    {
        MODIFY_REG(TIMx->CCMR2,(GPTIM_CCMR_CCS_Msk << ((Channel-2)*8)),(Mode << ((Channel-2)*8)));
    }   
}

/**
  * @brief    
  * @rmtoll   CCMR    CCS    LL_GPTIM_GetChannelMode
  * @param    TIMx TIM instance
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_GPTIM_CHANNEL_1
  *           @arg @ref LL_GPTIM_CHANNEL_2
  *           @arg @ref LL_GPTIM_CHANNEL_3
  *           @arg @ref LL_GPTIM_CHANNEL_4
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_GPTIM_CC_MODE_OUTPUT
  *           @arg @ref LL_GPTIM_CC1_MODE_INPUT_TI1
  *           @arg @ref LL_GPTIM_CC1_MODE_INPUT_TI2
  *           @arg @ref LL_GPTIM_CC2_MODE_INPUT_TI2
  *           @arg @ref LL_GPTIM_CC2_MODE_INPUT_TI1
  *           @arg @ref LL_GPTIM_CC3_MODE_INPUT_TI3
  *           @arg @ref LL_GPTIM_CC3_MODE_INPUT_TI4
  *           @arg @ref LL_GPTIM_CC4_MODE_INPUT_TI4
  *           @arg @ref LL_GPTIM_CC4_MODE_INPUT_TI3
  *           @arg @ref LL_GPTIM_CC_MODE_INPUT_TRC
  */
__STATIC_INLINE uint32_t LL_GPTIM_GetChannelMode(GPTIM_Type* TIMx, uint32_t Channel)
{
    if(Channel<LL_GPTIM_CHANNEL_3)
    {
        return (uint32_t)(READ_BIT(TIMx->CCMR1, (GPTIM_CCMR_CCS_Msk << (Channel*8))));
    }
    else
    {
        return (uint32_t)(READ_BIT(TIMx->CCMR2, (GPTIM_CCMR_CCS_Msk << ((Channel-2)*8))));
    }  
}

/**
  * @brief    
  * @rmtoll   CCER    CCOP    LL_GPTIM_SetOCPolartyChannel
  * @param    TIMx TIM instance
  * @param    Polarty This parameter can be one of the following values:
  *           @arg @ref LL_GPTIM_OC_POLARITY_NOMAL
  *           @arg @ref LL_GPTIM_OC_POLARITY_REVERSE
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_GPTIM_CHANNEL_1
  *           @arg @ref LL_GPTIM_CHANNEL_2
  *           @arg @ref LL_GPTIM_CHANNEL_3
  *           @arg @ref LL_GPTIM_CHANNEL_4
  * @retval   None
  */
__STATIC_INLINE void LL_GPTIM_SetOCPolartyChannel(GPTIM_Type* TIMx, uint32_t Polarty, uint32_t Channel)
{
    MODIFY_REG(TIMx->CCER,(GPTIM_CCER_CCOP_Msk << (Channel*4)),(Polarty << (Channel*4))); 
}

/**
  * @brief    
  * @rmtoll   CCER    CCOP    LL_GPTIM_GetOCPolartyChannel
  * @param    TIMx TIM instance
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_GPTIM_CHANNEL_1
  *           @arg @ref LL_GPTIM_CHANNEL_2
  *           @arg @ref LL_GPTIM_CHANNEL_3
  *           @arg @ref LL_GPTIM_CHANNEL_4
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_GPTIM_OC_POLARITY_NOMAL
  *           @arg @ref LL_GPTIM_OC_POLARITY_REVERSE
  */
__STATIC_INLINE uint32_t LL_GPTIM_GetOCPolartyChannel(GPTIM_Type* TIMx, uint32_t Channel)
{
    return (uint32_t)(READ_BIT(TIMx->CCER, (GPTIM_CCER_CCOP_Msk << (Channel*4)))); 
}

/**
  * @brief    
  * @rmtoll   CCER    CCIP    LL_GPTIM_SetICPolartyChannel
  * @param    TIMx TIM instance
  * @param    Polarty This parameter can be one of the following values:
  *           @arg @ref LL_GPTIM_IC_POLARITY_RISING
  *           @arg @ref LL_GPTIM_IC_POLARITY_FALLING
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_GPTIM_CHANNEL_1
  *           @arg @ref LL_GPTIM_CHANNEL_2
  *           @arg @ref LL_GPTIM_CHANNEL_3
  *           @arg @ref LL_GPTIM_CHANNEL_4
  * @retval   None
  */
__STATIC_INLINE void LL_GPTIM_SetICPolartyChannel(GPTIM_Type* TIMx, uint32_t Polarty, uint32_t Channel)
{
    MODIFY_REG(TIMx->CCER,(GPTIM_CCER_CCIP_Msk << (Channel*4)),(Polarty << (Channel*4))); 
}

/**
  * @brief    
  * @rmtoll   CCER    CCIP    LL_GPTIM_GetICPolartyChannel
  * @param    TIMx TIM instance
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_GPTIM_CHANNEL_1
  *           @arg @ref LL_GPTIM_CHANNEL_2
  *           @arg @ref LL_GPTIM_CHANNEL_3
  *           @arg @ref LL_GPTIM_CHANNEL_4
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_GPTIM_IC_POLARITY_RISING
  *           @arg @ref LL_GPTIM_IC_POLARITY_FALLING
  */
__STATIC_INLINE uint32_t LL_GPTIM_GetICPolartyChannel(GPTIM_Type* TIMx, uint32_t Channel)
{
    return (uint32_t)(READ_BIT(TIMx->CCER, (GPTIM_CCER_CCIP_Msk << (Channel*4)))); 
}

/**
  * @brief    
  * @rmtoll   CCER    CCOE    LL_GPTIM_EnableNormalChannelOutput
  * @param    TIMx TIM instance
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_GPTIM_CHANNEL_1
  *           @arg @ref LL_GPTIM_CHANNEL_2
  *           @arg @ref LL_GPTIM_CHANNEL_3
  *           @arg @ref LL_GPTIM_CHANNEL_4
  * @retval   None
  */
__STATIC_INLINE void LL_GPTIM_EnableNormalChannelOutput(GPTIM_Type* TIMx, uint32_t Channel)
{
    SET_BIT(TIMx->CCER,(GPTIM_CCER_CCE_Msk << (Channel*4))); 
}

/**
  * @brief    
  * @rmtoll   CCER    CCOE    LL_GPTIM_IsEnabledNormalChannelOutput
  * @param    TIMx TIM instance
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_GPTIM_CHANNEL_1
  *           @arg @ref LL_GPTIM_CHANNEL_2
  *           @arg @ref LL_GPTIM_CHANNEL_3
  *           @arg @ref LL_GPTIM_CHANNEL_4
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_GPTIM_IsEnabledNormalChannelOutput(GPTIM_Type* TIMx, uint32_t Channel)
{
    return (uint32_t)(READ_BIT(TIMx->CCER,(GPTIM_CCER_CCE_Msk << (Channel*4))) == (GPTIM_CCER_CCE_Msk << (Channel*4))); 
}

/**
  * @brief    
  * @rmtoll   CCER    CCOE    LL_GPTIM_DisableNormalChannelOutput
  * @param    TIMx TIM instance
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_GPTIM_CHANNEL_1
  *           @arg @ref LL_GPTIM_CHANNEL_2
  *           @arg @ref LL_GPTIM_CHANNEL_3
  *           @arg @ref LL_GPTIM_CHANNEL_4
  * @retval   None
  */
__STATIC_INLINE void LL_GPTIM_DisableNormalChannelOutput(GPTIM_Type* TIMx, uint32_t Channel)
{
    CLEAR_BIT(TIMx->CCER,(GPTIM_CCER_CCE_Msk << (Channel*4)));  
}
/**
  * @brief    
  * @rmtoll   CCER    CCOE    LL_GPTIM_EnableChannelCapture
  * @param    TIMx TIM instance
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_GPTIM_CHANNEL_1
  *           @arg @ref LL_GPTIM_CHANNEL_2
  *           @arg @ref LL_GPTIM_CHANNEL_3
  *           @arg @ref LL_GPTIM_CHANNEL_4
  * @retval   None
  */
__STATIC_INLINE void LL_GPTIM_EnableChannelCapture(GPTIM_Type* TIMx, uint32_t Channel)
{
    SET_BIT(TIMx->CCER,(GPTIM_CCER_CCE_Msk << (Channel*4))); 
}

/**
  * @brief    
  * @rmtoll   CCER    CCOE    LL_GPTIM_IsEnabledChannelCapture
  * @param    TIMx TIM instance
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_GPTIM_CHANNEL_1
  *           @arg @ref LL_GPTIM_CHANNEL_2
  *           @arg @ref LL_GPTIM_CHANNEL_3
  *           @arg @ref LL_GPTIM_CHANNEL_4
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_GPTIM_IsEnabledChannelCapture(GPTIM_Type* TIMx, uint32_t Channel)
{
    return (uint32_t)(READ_BIT(TIMx->CCER,(GPTIM_CCER_CCE_Msk << (Channel*4))) == (GPTIM_CCER_CCE_Msk << (Channel*4))); 
}

/**
  * @brief    
  * @rmtoll   CCER    CCOE    LL_GPTIM_DisableChannelCapture
  * @param    TIMx TIM instance
  * @param    Channel This parameter can be one of the following values:
  *           @arg @ref LL_GPTIM_CHANNEL_1
  *           @arg @ref LL_GPTIM_CHANNEL_2
  *           @arg @ref LL_GPTIM_CHANNEL_3
  *           @arg @ref LL_GPTIM_CHANNEL_4
  * @retval   None
  */
__STATIC_INLINE void LL_GPTIM_DisableChannelCapture(GPTIM_Type* TIMx, uint32_t Channel)
{
    CLEAR_BIT(TIMx->CCER,(GPTIM_CCER_CCE_Msk << (Channel*4)));  
}
/**
  * @}
  */

/** @defgroup GPTIM_LL_EF_Init Initialization and de-initialization functions
  * @{
  */
ErrorStatus LL_GPTIM_DeInit(GPTIM_Type *TIMx);

void LL_GPTIM_StructInit(LL_GPTIM_InitTypeDef *TIM_InitStruct);
void LL_GPTIM_SlaveModeStructInit(LL_GPTIM_SlaveInitTypeDef *TIM_InitStruct);
void LL_GPTIM_OC_StructInit(LL_GPTIM_OC_InitTypeDef *TIM_OC_InitStruct);
void LL_GPTIM_IC_StructInit(LL_GPTIM_IC_InitTypeDef *TIM_ICInitStruct);
void LL_GPTIM_ETRStructInit(LL_GPTIM_ETR_InitTypeDef *TIM_InitStruct);

ErrorStatus LL_GPTIM_Init(GPTIM_Type *TIMx, LL_GPTIM_InitTypeDef *TIM_InitStruct);
ErrorStatus LL_GPTIM_SlaveMode_Init(GPTIM_Type *TIMx, LL_GPTIM_SlaveInitTypeDef *TIM_InitStruct);
ErrorStatus LL_GPTIM_OC_Init(GPTIM_Type *TIMx, uint32_t Channel, LL_GPTIM_OC_InitTypeDef *TIM_OC_InitStruct);
ErrorStatus LL_GPTIM_IC_Init(GPTIM_Type *TIMx, uint32_t Channel, LL_GPTIM_IC_InitTypeDef *TIM_IC_InitStruct);
ErrorStatus LL_GPTIM_ETR_Init(GPTIM_Type *TIMx, LL_GPTIM_ETR_InitTypeDef* TIM_InitStruct);


/**
  * @}
  */


/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* __FM33LC0XX_LL_GPTIM_H*/

/**************************Py_Code_Generator Version: 0.1-0.5-0.1 @ 2019-10-22**************************/
/*************************(C) COPYRIGHT Fudan Microelectronics **** END OF FILE*************************/

